c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
/*
 * ESP32 PhotoFrame Fetcher - POWER-OPTIMIZED VERSION
 * 
 * SPDX-License-Identifier: Apache-2.0
 * Copyright (c) 2025 Florian Braun (FloThinksPi)
 * 
 * Power Optimizations:
 * - CPU: 120MHz single-core for power efficiency
 * - WiFi: Low power mode (2dBm TX, MAX_MODEM sleep) for battery conservation
 * - Memory: ESP32-specific heap allocation and DMA-capable buffers
 * - Transfer: Zero-copy burst transfers with pre-compiled command buffers
 * - Target: Balance performance with power consumption for battery operation
 */

#include <Arduino.h>
#include <WiFiManager.h>
#include <WiFiClientSecure.h> // For HTTPS support
#include <Wire.h>
#include <Preferences.h> // For persistent URL storage
#include <DNSServer.h> // For captive portal support

#ifdef ESP8266
#include <ESP8266HTTPClient.h>
#include <ESP8266mDNS.h>
#include <ESP8266WebServer.h> // For web UI
#include <ESP8266WiFi.h>

#define WebServer ESP8266WebServer
#define UPDATE_SIZE_UNKNOWN 0xFFFFFFFF
#define WIFI_AUTH_OPEN ENC_TYPE_NONE

static uint64_t mySleepTimeUS = 30ULL * 60ULL * 1000000ULL;
#define esp_deep_sleep_start() ESP.deepSleep(mySleepTimeUS)
#define esp_sleep_enable_timer_wakeup(sleepTimeUS) do { mySleepTimeUS = (sleepTimeUS); } while(0)

#define IMAGE7COLOR_SIZE 192000

#else /* ESP32 */
#include <ImageData.h>
#include <HTTPClient.h>
#include <ESPmDNS.h>
#include <esp_sleep.h> // For deep sleep power management
#include <WebServer.h> // For web UI
#include <Update.h> // For OTA firmware updates

// ESP32 WiFi Power Management Includes
#include <WiFi.h>
#include <esp_wifi.h>

// ESP32 Model Detection Includes
#include <esp_chip_info.h>
#include <esp_system.h>

#define IMAGE7COLOR_SIZE sizeof(Image7color)
#endif

// ESP32 Performance Optimization Includes
#ifdef ESP32_PERFORMANCE_OPTIMIZED
extern "C" {
  #include "esp_timer.h"
  #include "esp_system.h"
  #include "esp_heap_caps.h"
}
#endif

// Forward declarations
static void autoFetchOnBoot();
static bool downloadAndConvertBmpImage(const char* url);
static bool sendImageChunkBurst(uint32_t start_address, const uint8_t* data, size_t total_size);
static bool sendBatteryInfoToDisplay(float voltage, uint32_t cycles);
static bool setDebugMode(bool enable);
static int calculateBatteryPercentage(float voltage);
static void saveUrls();
static void saveAdminSettings();
static void initUrlStorage();
static void saveBatteryData();
static String getCurrentUrlAndAdvance();

// Helper function to clean up HTTP client and WiFiClient
static void cleanupHttpClient(HTTPClient& http, WiFiClient* client) {
  http.end();
  if (client) {
    delete client;
    client = nullptr;
  }
}
static bool addUrl(const String& url);
static bool removeUrl(int index);

// ESP32 Model Detection and Information Display
static void printESP32ModelInfo();
static bool checkAuthentication();
static void handleLogin();
static void handleLogout();
static void handleDisplayCurrent();
static void handleDisplayImage();
static void handleNextImage();
static String getLoginPage();
static void handleFirmwareUpdate();
static void handleChangePassword();

// E-paper color definitions (4-bit values)
#define EPD_7IN3F_BLACK   0x0	/// 000
#define EPD_7IN3F_WHITE   0x1	///	001
#define EPD_7IN3F_GREEN   0x2	///	010
#define EPD_7IN3F_BLUE    0x3	///	011
#define EPD_7IN3F_RED     0x4	///	100
#define EPD_7IN3F_YELLOW  0x5	///	101
#define EPD_7IN3F_ORANGE  0x6	///	110
#define EPD_7IN3F_CLEAN   0x7	///	111   unavailable

/*Bitmap file header   14bit*/
typedef struct BMP_FILE_HEADER {
    uint16_t bType;        //File identifier
    uint32_t bSize;        //The size of the file
    uint16_t bReserved1;   //Reserved value, must be set to 0
    uint16_t bReserved2;   //Reserved value, must be set to 0
    uint32_t bOffset;      //The offset from the beginning of the file header to the beginning of the image data bit
} __attribute__ ((packed)) BMPFILEHEADER;    // 14bit

/*Bitmap information header  40bit*/
typedef struct BMP_INFO {
    uint32_t biInfoSize;      //The size of the header
    uint32_t biWidth;         //The width of the image
    uint32_t biHeight;        //The height of the image
    uint16_t biPlanes;        //The number of planes in the image
    uint16_t biBitCount;      //The number of bits per pixel
    uint32_t biCompression;   //Compression type
    uint32_t bimpImageSize;   //The size of the image, in bytes
    uint32_t biXPelsPerMeter; //Horizontal resolution
    uint32_t biYPelsPerMeter; //Vertical resolution
    uint32_t biClrUsed;       //The number of colors used
    uint32_t biClrImportant;  //The number of important colors
} __attribute__ ((packed)) BMPINFOHEADER;

// I2C Pin Configuration - PERFORMANCE OPTIMIZED
// Using ESP32 hardware I2C pins with maximum performance settings
#ifdef ESP8266
static int I2C_SDA_PIN = 0;   // ESP8266 pin 0 connects to Renderer pin 4 (SDA)
static int I2C_SCL_PIN = 2;   // ESP8266 pin 2 connects to Renderer pin 5 (SCL)
#else
static int I2C_SDA_PIN = 21;   // ESP32 pin 21 connects to Renderer pin 4 (SDA)  
static int I2C_SCL_PIN = 22;   // ESP32 pin 22 connects to Renderer pin 5 (SCL)
#endif
#define PI_PICO_I2C_ADDRESS 0x42  // Pi Pico I2C slave address

// PERFORMANCE OPTIMIZATION: Maximum I2C clock speed for ESP32
#define I2C_CLOCK_SPEED 5000000   // 5MHz - Maximum reliable speed for ESP32 Wire

static WiFiManager wm;

// Web server for configuration UI
static WebServer server(80);

// URL Management
#define MAX_URLS 10              // Maximum number of URLs to store
#define MAX_URL_LENGTH 512       // Maximum length per URL
static Preferences preferences;         // For persistent URL storage
static String imageUrls[MAX_URLS];      // Array to hold URLs
static int urlCount = 0;                // Current number of URLs
static int currentUrlIndex = 0;         // Index of current URL being used

// Global variables for web UI display
static float current_battery_voltage = 0.0f;
static uint32_t current_wakeup_interval = 30;
static uint8_t current_charging_status = 3; // 0=not charging, 1=charging, 2=charge complete, 3=no external power
static bool current_debug_mode = false; // Track debug mode status
static uint32_t display_cycle_count = 0; // Track number of display updates for battery info
static unsigned long last_status_update = 0;

// Flash wear leveling for URL storage
static uint32_t write_cycle_counter = 0; // Track total write cycles for wear distribution

