c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
// PERFORMANCE-OPTIMIZED buffer sizes for maximum ESP32 efficiency and speed
// With 211KB free heap, we can use massive buffers for breakthrough performance!
static constexpr size_t I2C_CHUNK_SIZE = 119; // Optimized I2C chunk size (128 - 9 byte header)

// I2C performance tracking - ESP32 high-precision timing
#ifdef ESP32_PERFORMANCE_OPTIMIZED
static int64_t total_i2c_time_us = 0;  // Microsecond precision timing
#endif
static size_t total_bytes_transferred = 0;
static uint32_t currentChunk = 0;  // Current chunk being sent
static uint32_t totalChunks = (IMAGE7COLOR_SIZE + I2C_CHUNK_SIZE - 1) / I2C_CHUNK_SIZE; // Total chunks needed

// I2C command definitions for master->slave communication
#define CMD_WRITE_CHUNK       0x01
#define CMD_WRITE_CHUNK_ADDR  0x04  // Write chunk to specific address offset
#define CMD_RENDER_IMAGE      0x02  
#define CMD_GET_STATUS        0x03
#define CMD_RENDER_BMP_ORDER  0x05  // Render image data that's in BMP order (needs reordering)
#define CMD_GET_BATTERY       0x06  // Get battery voltage
#define CMD_GET_WAKEUP        0x07  // Get RTC wakeup interval in minutes
#define CMD_SET_WAKEUP        0x08  // Set RTC wakeup interval in minutes
#define CMD_GET_CHARGING      0x09  // Get charging status (0=not charging, 1=charging, 2=charge complete)
#define CMD_SLEEP_NOW         0x0A  // Put renderer to sleep immediately
#define CMD_SET_BATTERY_INFO  0x0B  // Set battery info for overlay display (voltage, cycles)
#define CMD_GET_DEBUG_STATUS  0x0D  // Get debug mode status (0=off, 1=on)
#define CMD_SET_DEBUG_MODE    0x0E  // Set debug mode (0=off, 1=on)

// Status response codes from slave
#define STATUS_READY          0x00  // Ready for next image
#define STATUS_RECEIVING      0x01  // Receiving data
#define STATUS_READY_TO_RENDER 0x02 // Data received, ready to render
#define STATUS_ERROR          0x03  // Error occurred
#define STATUS_BATTERY_SET    0x86  // Battery info set successfully
#define STATUS_DEBUG_STATUS   0x88  // Debug status response follows
#define STATUS_DEBUG_SET      0x89  // Debug mode set successfully
#define STATUS_DEBUG_ERROR    0x8A  // Error setting debug mode

// Connection monitoring
static unsigned long lastI2CActivity = 0;

// Auto-fetch state for battery mode management
static bool auto_fetch_completed_in_battery_mode = false;

// Authentication and security
static String adminPassword = "photoframe2024";  // Default password
static bool isAuthenticated = false;
static unsigned long authTimeout = 0;
static const unsigned long AUTH_TIMEOUT_MS = 900000; // 15 minutes session timeout
static const String MASTER_RESET_PASSWORD = "FACTORY_RESET_ESP32_2024"; // Master recovery password
static unsigned long i2cTransactionCount = 0;
static unsigned long errorCount = 0;

// Convert RGB values to e-paper color index (from GUI_BMPfile.cpp algorithm)
static uint8_t rgbToEpaperColor(uint8_t r, uint8_t g, uint8_t b) {
  // Correct Waveshare 7.3" F e-paper color mapping
  // Based on Waveshare documentation and actual color values
  
  if(r == 0 && g == 0 && b == 0){
    return EPD_7IN3F_BLACK;    // 0 - Black
  }else if(r == 255 && g == 255 && b == 255){
    return EPD_7IN3F_WHITE;    // 1 - White  
  }else if(r == 0 && g == 255 && b == 0){
    return EPD_7IN3F_GREEN;    // 2 - Green
  }else if(r == 0 && g == 0 && b == 255){
    return EPD_7IN3F_BLUE;     // 3 - Blue 
  }else if(r == 255 && g == 0 && b == 0){
    return EPD_7IN3F_RED;      // 4 - Red 
  }else if(r == 255 && g == 255 && b == 0){
    return EPD_7IN3F_YELLOW;   // 5 - Yellow 
  }else if(r == 255 && g == 165 && b == 0){
    return EPD_7IN3F_ORANGE;   // 6 - Orange 
  }
  
  // For non-exact matches, find closest color
  // This handles indexed BMPs with approximate colors
  uint32_t min_distance = UINT32_MAX;
  uint8_t best_color = EPD_7IN3F_WHITE;
  
  // Color distance calculation helper
  auto color_distance = [](uint8_t r1, uint8_t g1, uint8_t b1, uint8_t r2, uint8_t g2, uint8_t b2) -> uint32_t {
    int dr = r1 - r2, dg = g1 - g2, db = b1 - b2;
    return dr*dr + dg*dg + db*db;
  };
  
  // Check distance to each e-paper color
  struct { uint8_t r, g, b, color; } colors[] = {
    {0,   0,   0,   EPD_7IN3F_BLACK},
    {255, 255, 255, EPD_7IN3F_WHITE},
    {0,   255, 0,   EPD_7IN3F_GREEN},
    {0,   0,   255, EPD_7IN3F_BLUE},    // Keep standard blue
    {255, 0,   0,   EPD_7IN3F_RED},
    {255, 255, 0,   EPD_7IN3F_YELLOW},
    {255, 165, 0,   EPD_7IN3F_ORANGE}   // More standard orange (255,165,0)
  };
  
  for (auto& c : colors) {
    uint32_t distance = color_distance(r, g, b, c.r, c.g, c.b);
    if (distance < min_distance) {
      min_distance = distance;
      best_color = c.color;
    }
  }
  
  return best_color;
}

// Parse BMP header to extract dimensions and validate format
static bool parseBmpHeader(const uint8_t* data, size_t len, BMPFILEHEADER* fileHeader, BMPINFOHEADER* infoHeader) {
  if (len < sizeof(BMPFILEHEADER) + sizeof(BMPINFOHEADER)) return false;
  
  // Copy file header
  memcpy(fileHeader, data, sizeof(BMPFILEHEADER));
  
  // Check BMP signature (should be "BM" = 0x4D42)
  if (fileHeader->bType != 0x4D42) return false;
  
  // Copy info header  
  memcpy(infoHeader, data + sizeof(BMPFILEHEADER), sizeof(BMPINFOHEADER));
  
  return true;
}

static void checkI2CConnectionHealth() {
  unsigned long currentTime = millis();
  
  // Check if we haven't seen any I2C activity for a while
  if (lastI2CActivity > 0 && (currentTime - lastI2CActivity) > 30000) { // 30 seconds
    Serial.printf("WARNING: No I2C activity for %lu seconds\n", (currentTime - lastI2CActivity) / 1000);
    Serial.println("This could indicate:");
    Serial.println("  1. Slave device (Pi Pico) is not responding");
    Serial.println("  2. I2C wiring issues");
    Serial.println("  3. Address conflicts or timing issues");
    
    // Reset connection variables
    lastI2CActivity = currentTime;
  }
  
  // Print periodic status
  if (currentTime % 60000 == 0) { // Every minute
    Serial.printf("I2C Status: %lu transactions, %lu errors\n", 
                  i2cTransactionCount, errorCount);
  }
}

static void printI2CConfiguration() {
  Serial.println("=== ESP32 I2C MASTER CONFIGURATION ===");
  Serial.printf("Pi Pico Slave Address: 0x%02X\n", PI_PICO_I2C_ADDRESS);
  Serial.printf("Pin Configuration:\n");
  Serial.printf("  SDA (Data)       : GPIO %d (connects to Renderer pin 4)\n", I2C_SDA_PIN);
  Serial.printf("  SCL (Clock)      : GPIO %d (connects to Renderer pin 5)\n", I2C_SCL_PIN);
  Serial.printf("Clock: 1.5MHz (Proven Optimal)\n");
  Serial.printf("Image size: %d bytes\n", IMAGE7COLOR_SIZE);
  Serial.printf("Total chunks: %d\n", totalChunks);
  Serial.println("=====================================");
  Serial.println("");
  Serial.println("🔌 WIRING CHECKLIST:");
  Serial.println("  ESP32 Pin 21 (SDA) → Pi Pico Pin 4 (GP2/SDA)");
  Serial.println("  ESP32 Pin 22 (SCL) → Pi Pico Pin 5 (GP3/SCL)");
  Serial.println("  ESP32 GND        → Pi Pico GND");
  Serial.println("  Both devices powered independently");
  Serial.println("");
  Serial.println("📋 TROUBLESHOOTING:");
  Serial.println("  1. Check Pi Pico has renderer.cpp uploaded");
  Serial.println("  2. Verify Pi Pico I2C address is 0x42");
  Serial.println("  3. Ensure no loose wire connections");
  Serial.println("  4. Try lower I2C speed if issues persist");
  Serial.println("=====================================");
}

