c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
  if (error == 0) {
    Serial.println("✓ Render command sent");
    lastI2CActivity = millis();
    display_cycle_count++; // Increment display cycle counter
    Serial.printf("Display cycle count: %d\n", display_cycle_count);
    saveBatteryData(); // Save updated cycle count
    return true;
  } else {
    Serial.printf("✗ Failed to send render command (error: %d)\n", error);
    errorCount++;
    return false;
  }
}

// Send BMP reorder and render command to Pi Pico slave
static bool sendBmpRenderCommand() {
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_RENDER_BMP_ORDER);
  uint8_t error = Wire.endTransmission();
  
  if (error == 0) {
    Serial.println("✓ BMP reorder and render command sent");
    lastI2CActivity = millis();
    display_cycle_count++; // Increment display cycle counter  
    Serial.printf("Display cycle count: %d\n", display_cycle_count);
    saveBatteryData(); // Save updated cycle count
    return true;
  } else {
    Serial.printf("✗ Failed to send BMP render command (error: %d)\n", error);
    errorCount++;
    return false;
  }
}

// Test I2C communication with Pi Pico
static bool testI2CConnection() {
  Serial.println("=== TESTING I2C CONNECTION ===");
  
  // Test 1: Simple address check
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("✗ Basic I2C test failed (error: %d)\n", error);
    if (error == 2) {
      Serial.println("  → Address NACK - Pi Pico not responding at 0x42");
      Serial.println("  → Check: Pi Pico powered? I2C slave code running?");
    } else if (error == 5) {
      Serial.println("  → Timeout - Check I2C wiring and connections");
    }
    return false;
  }
  
  Serial.println("✓ Basic I2C address test passed");
  
  // Test 2: Try to get status (simple read test)
  Serial.println("Testing status read...");
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_GET_STATUS);
  error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("✗ Status command failed (error: %d)\n", error);
    return false;
  }
  
  // Request response
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
  
  if (Wire.available()) {
    uint8_t status = Wire.read();
    Serial.printf("✓ Pi Pico status read successful: 0x%02X\n", status);
    return true;
  } else {
    Serial.println("✗ No status response - Pi Pico may not have I2C slave code running");
    return false;
  }
}

// Get status from Pi Pico slave
static uint8_t getSlaveStatus() {
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_GET_STATUS);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("✗ Failed to send status request (error: %d)\n", error);
    return STATUS_ERROR;
  }
  
  // Request 1 byte response
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
  
  if (Wire.available()) {
    uint8_t status = Wire.read();
    lastI2CActivity = millis();
    return status;
  } else {
    Serial.println("✗ No status response from slave");
    return STATUS_ERROR;
  }
}

// Wait for renderer to complete and confirm render status
static bool waitForRenderCompletion(uint32_t timeout_ms = 30000) {
  Serial.println("Waiting for renderer to be ready for rendering...");
  unsigned long start_time = millis();
  
  while ((millis() - start_time) < timeout_ms) {
    uint8_t status = getSlaveStatus();
    
    if (status == STATUS_READY) {
      Serial.println("✓ Renderer completed successfully - display updated!");
      return true;
    } else if (status == STATUS_ERROR) {
      Serial.println("✗ Renderer reported error during rendering");
      return false;
    } else if (status == STATUS_READY_TO_RENDER) {
      Serial.println("✓ PERFECT TIMING: Renderer has all data and is ready to render!");
      Serial.println("🔋 ESP32 job complete - shutting down for maximum power savings!");
      return true; // ESP32 can shut down now - Pi Pico will handle the rest
    } else if (status == STATUS_RECEIVING) {
      Serial.printf("Renderer receiving data... (status: 0x%02X)\n", status);
    } else if (status == STATUS_BATTERY_SET) {
      Serial.println("✓ Battery info successfully set on renderer");
    } else if (status == STATUS_DEBUG_SET) {
      Serial.println("✓ Debug mode successfully set on renderer");
    } else if (status == STATUS_DEBUG_ERROR) {
      Serial.println("✗ Error setting debug mode on renderer");
    } else {
      Serial.printf("Unknown renderer status: 0x%02X\n", status);
    }
    
    delay(1000); // Check every second
  }
  
  Serial.printf("✗ Timeout waiting for renderer completion after %d seconds\n", timeout_ms / 1000);
  return false;
}

// Shut down ESP32 for maximum power savings
static void shutdownESP32() {
  Serial.println("=== POWER SHUTDOWN SEQUENCE ===");
  Serial.println("✓ Image transfer and rendering completed successfully");
  Serial.println("💤 Shutting down ESP32 to save battery power...");
  Serial.println("Device will remain off until manually reset or power cycled");
  Serial.println("=====================================");
  
  // Give time for serial output to complete
  Serial.flush();
  delay(10);
  
  // Put ESP32 into deep sleep mode (lowest power consumption)
  // Note: ESP32 will stay in deep sleep until reset button is pressed
  // or power is cycled, as we're not setting a wake-up timer
  esp_deep_sleep_start();
}

#ifndef ESP8266
// Send complete image to Pi Pico slave
static bool sendCompleteImage() {
  // Determine image source and size
  const uint8_t* image_data;
  size_t image_size;
  
  image_data = Image7color;
  image_size = sizeof(Image7color);
  Serial.printf("Using static image: %d bytes\n", image_size);
  
  uint32_t totalChunks = (image_size + I2C_CHUNK_SIZE - 1) / I2C_CHUNK_SIZE;
  Serial.printf("Starting image transfer: %d bytes in %d chunks\n", image_size, totalChunks);
  
  // Reset chunk counter
  currentChunk = 0;
  
  // Send all chunks at maximum speed
  unsigned long transfer_start = millis();
  for (uint32_t chunk = 0; chunk < totalChunks; chunk++) {
    uint32_t offset = chunk * I2C_CHUNK_SIZE;
    size_t remaining = image_size - offset;
    size_t chunk_size = (remaining > I2C_CHUNK_SIZE) ? I2C_CHUNK_SIZE : remaining;
    
    if (!sendImageChunk(chunk, &image_data[offset], chunk_size)) {
      Serial.printf("✗ Failed to send chunk %d after retries\n", chunk);
      return false;
    }
    
    // Optimized progress reporting - every 200 chunks or at completion for speed
    if (chunk % 200 == 0 || chunk == totalChunks - 1) {
      float percent = ((float)(chunk + 1) / totalChunks) * 100.0;
      uint32_t bytes_sent = (chunk + 1) * I2C_CHUNK_SIZE;
      if (bytes_sent > image_size) bytes_sent = image_size;
      unsigned long elapsed = millis() - transfer_start;
      float kbps = elapsed > 0 ? (bytes_sent / (float)elapsed) : 0;
      
