c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
      Serial.printf("📊 Progress: %d/%d chunks (%.1f%%) - %d/%d bytes (%.1f KB/s)\n", 
                    chunk + 1, totalChunks, percent, bytes_sent, image_size, kbps);
    }
  }
  
  // Send render command
  if (!sendRenderCommand()) {
    return false;
  }
  
  Serial.println("✓ Complete image sent and render command issued");
  return true;
}
#endif

static bool initI2C() {
  Serial.println("Initializing I2C master communication...");
  
  printI2CConfiguration();

  Serial.println("ESP32 PERFORMANCE: Instant I2C bus initialization...");
  
  Serial.printf("🚀 ESP32 I2C Performance Mode: SDA=%d, SCL=%d\n", I2C_SDA_PIN, I2C_SCL_PIN);
  
  // ESP32 MAXIMUM PERFORMANCE: Initialize I2C with breakthrough optimizations
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  
  #ifdef ESP32_PERFORMANCE_OPTIMIZED
  // ESP32-SPECIFIC: Set maximum I2C clock with hardware optimization
  Wire.setClock(I2C_CLOCK_SPEED); // 2MHz for ESP32 breakthrough performance
  
  // Initialize performance tracking with ESP32 high-precision timers
  total_bytes_transferred = 0;
  total_i2c_time_us = 0;
  
  Serial.printf("⚡ ESP32 POWER-EFFICIENT: %.1f MHz I2C @ 120MHz CPU\n", 
                I2C_CLOCK_SPEED / 1000000.0);
  #else
  Wire.setClock(1500000); // Fallback to 1.5MHz for compatibility
  Serial.println("⚡ I2C Power-Efficient Mode: 1.5MHz (compatibility)");
  #endif
  
  Wire.setTimeout(8000); // Optimal timeout for reliable transfers

  Serial.println("✅ ESP32 I2C Performance initialization complete");
  
  #ifdef ESP32_PERFORMANCE_OPTIMIZED
  Serial.printf("⚡ POWER-OPTIMIZED config: SDA=%d, SCL=%d, Clock=%.1fMHz, CPU=120MHz, Low-Power\n", 
                I2C_SDA_PIN, I2C_SCL_PIN, I2C_CLOCK_SPEED / 1000000.0);
  #else
  Serial.printf("⚡ POWER-OPTIMIZED config: SDA=%d, SCL=%d, Clock=1.5MHz, Timeout=8s\n", 
                I2C_SDA_PIN, I2C_SCL_PIN);
  #endif
  
  Serial.printf("📡 Communicating with Pi Pico slave at address 0x%02X\n", PI_PICO_I2C_ADDRESS);
  Serial.println("🔌 Physical connections:");
  Serial.println("  ESP32 pin 21 (SDA) ↔ Pi Pico pin 4 (SDA)");
  Serial.println("  ESP32 pin 22 (SCL) ↔ Pi Pico pin 5 (SCL)");
  
  // Reset connection variables
  lastI2CActivity = 0;
  i2cTransactionCount = 0;
  errorCount = 0;
  currentChunk = 0;
  
  return true;
}

// ESP32 Model Detection and Information Display
static void printESP32ModelInfo() {
#ifdef ESP8266
  Serial.println("\n📱 === ESP8266 HARDWARE INFORMATION ===");
  // Chip Information
  Serial.printf("🔧 Chip-ID: %08x\n", ESP.getChipId());
  Serial.printf("⚡ CPU Frequency: %d MHz\n", ESP.getCpuFreqMHz());
  // Flash information
  Serial.printf("💾 Flash Size: %.1f MiB\n", ESP.getFlashChipSize() / (1024.0 * 1024.0));
  Serial.printf("⚡ Flash Speed: %.1f MHz\n", ESP.getFlashChipSpeed() / (1000.0 * 1000.0));
  // Memory information
  Serial.printf("🆓 Free Heap: %d bytes (%.1f KiB)\n", ESP.getFreeHeap(), ESP.getFreeHeap() / 1024.0);
#else /* ESP32 */
  esp_chip_info_t chip_info;
  esp_chip_info(&chip_info);
  
  Serial.println("\n📱 === ESP32 HARDWARE INFORMATION ===");
  
  // Determine ESP32 model
  String model = "Unknown ESP32";
  switch(chip_info.model) {
    case CHIP_ESP32:
      model = "ESP32";
      break;
    #if defined(CONFIG_IDF_TARGET_ESP32S2) || defined(ESP32S2)
    case CHIP_ESP32S2:
      model = "ESP32-S2";
      break;
    #endif
    #if defined(CONFIG_IDF_TARGET_ESP32S3) || defined(ESP32S3)  
    case CHIP_ESP32S3:
      model = "ESP32-S3";
      break;
    #endif
    #if defined(CONFIG_IDF_TARGET_ESP32C3) || defined(ESP32C3)
    case CHIP_ESP32C3:
      model = "ESP32-C3";
      break;
    #endif
    #if defined(CONFIG_IDF_TARGET_ESP32C6) || defined(ESP32C6)
    case CHIP_ESP32C6:
      model = "ESP32-C6";
      break;
    #endif
    #if defined(CONFIG_IDF_TARGET_ESP32H2) || defined(ESP32H2)
    case CHIP_ESP32H2:
      model = "ESP32-H2";
      break;
    #endif
    default:
      model = "ESP32 (Unknown Variant)";
      break;
  }
  
  Serial.printf("🔧 Model: %s\n", model.c_str());
  Serial.printf("📊 CPU Cores: %d\n", chip_info.cores);
  Serial.printf("🏷️  Chip Revision: %d\n", chip_info.revision);
  Serial.printf("⚡ CPU Frequency: %d MHz\n", getCpuFrequencyMhz());
  
  // Flash information
  uint32_t flash_size = 0;
  esp_flash_get_size(NULL, &flash_size);
  Serial.printf("💾 Flash Size: %.1f MB\n", flash_size / (1024.0 * 1024.0));
  
  // Memory information
  Serial.printf("🧠 Total Heap: %d bytes (%.1f KB)\n", ESP.getHeapSize(), ESP.getHeapSize() / 1024.0);
  Serial.printf("🆓 Free Heap: %d bytes (%.1f KB)\n", ESP.getFreeHeap(), ESP.getFreeHeap() / 1024.0);
  
  // Features
  Serial.println("🔧 Features:");
  if (chip_info.features & CHIP_FEATURE_WIFI_BGN) {
    Serial.println("   • WiFi 2.4GHz (802.11 b/g/n)");
  }
  if (chip_info.features & CHIP_FEATURE_BT) {
    Serial.println("   • Bluetooth Classic");
  }
  if (chip_info.features & CHIP_FEATURE_BLE) {
    Serial.println("   • Bluetooth Low Energy (BLE)");
  }
  if (chip_info.features & CHIP_FEATURE_EMB_FLASH) {
    Serial.println("   • Embedded Flash Memory");
  }
  if (chip_info.features & CHIP_FEATURE_EMB_PSRAM) {
    Serial.println("   • Embedded PSRAM");
  }
  
  Serial.printf("🌡️  Chip Temperature: %.1f°C\n", temperatureRead());
  Serial.println("======================================\n");
#endif
}

// Get battery voltage from Pi Pico with retry logic
static float getBatteryVoltage() {
  Serial.println("Requesting battery voltage from Pi Pico...");
  unsigned long battery_start = millis();
  
  // Try multiple times in case Pi Pico is busy
  for (int attempt = 1; attempt <= 3; attempt++) {
    Serial.printf("Battery voltage attempt %d/3\n", attempt);
    
    Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
    Wire.write(CMD_GET_BATTERY);
    uint8_t error = Wire.endTransmission();
    
    if (error != 0) {
      Serial.printf("Failed to send battery command, error: %d", error);
      if (error == 2) {
        Serial.println(" (NACK on address - Pi Pico not responding)");
      } else if (error == 5) {
        Serial.println(" (Timeout - Pi Pico may be busy)");
      } else {
        Serial.printf(" (Unknown I2C error)\n");
      }
      
      if (attempt < 3) {
        Serial.printf("Waiting 200ms before retry...\n");
        delay(200); // Wait longer between retries
        continue;
      }
      unsigned long battery_time = millis() - battery_start;
      Serial.printf("⏱️ Battery voltage failed after: %lu ms\n", battery_time);
      return -1.0f;
    }
    
