c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
    // Wait longer for Pi Pico to prepare response, especially if it's processing images
    delay(100); // Increased from 50ms to 100ms
    
    Wire.requestFrom(PI_PICO_I2C_ADDRESS, 4);
    
    // Wait up to 500ms for response
    unsigned long start = millis();
    while (Wire.available() < 4 && (millis() - start) < 500) {
      delay(10);
    }
    
    if (Wire.available() >= 4) {
      float voltage;
      uint8_t* voltage_bytes = (uint8_t*)&voltage;
      for (int i = 0; i < 4; i++) {
        voltage_bytes[i] = Wire.read();
      }
      
      // Validate voltage reading (should be between 2.5V and 5.0V)
      if (voltage >= 2.5f && voltage <= 5.0f) {
        unsigned long battery_time = millis() - battery_start;
        Serial.printf("✓ Battery voltage: %.3f V (attempt %d) - took %lu ms\n", voltage, attempt, battery_time);
        return voltage;
      } else {
        Serial.printf("✗ Invalid battery voltage: %.3f V (attempt %d)\n", voltage, attempt);
        if (attempt < 3) {
          delay(200);
          continue;
        }
      }
    } else {
      Serial.printf("Failed to read battery voltage response (got %d bytes, attempt %d)\n", 
                   Wire.available(), attempt);
      if (attempt < 3) {
        delay(200);
        continue;
      }
    }
  }
  
  unsigned long battery_time = millis() - battery_start;
  Serial.printf("✗ All battery voltage attempts failed - Pi Pico may be unresponsive (took %lu ms)\n", battery_time);
  return -1.0f;
}

// Send battery information to Pi Pico for display overlay
static bool sendBatteryInfoToDisplay(float voltage, uint32_t cycles) {
  Serial.printf("Sending battery info to display: %.2fV, %d cycles\n", voltage, cycles);
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_SET_BATTERY_INFO);
  
  // Send voltage as 4-byte float
  uint8_t* voltage_bytes = (uint8_t*)&voltage;
  for (int i = 0; i < 4; i++) {
    Wire.write(voltage_bytes[i]);
  }
  
  // Send cycles as 4-byte uint32_t
  uint8_t* cycle_bytes = (uint8_t*)&cycles;
  for (int i = 0; i < 4; i++) {
    Wire.write(cycle_bytes[i]);
  }
  
  uint8_t error = Wire.endTransmission();
  
  if (error == 0) {
    Serial.println("✓ Battery info sent to display");
    return true;
  } else {
    Serial.printf("✗ Failed to send battery info, error: %d\n", error);
    return false;
  }
}

// Set debug mode on Pi Pico
static bool setDebugMode(bool enable) {
  Serial.printf("Setting debug mode: %s\n", enable ? "ON" : "OFF");
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_SET_DEBUG_MODE);
  Wire.write(enable ? 1 : 0);
  uint8_t error = Wire.endTransmission();
  
  if (error == 0) {
    // Wait for response status
    delay(100);
    
    // Check status by reading response
    Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
    Wire.write(CMD_GET_STATUS);
    error = Wire.endTransmission();
    
    if (error == 0) {
      Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
      unsigned long start = millis();
      while (Wire.available() < 1 && (millis() - start) < 300) {
        delay(10);
      }
      
      if (Wire.available() >= 1) {
        uint8_t status = Wire.read();
        if (status == STATUS_DEBUG_SET) {
          Serial.printf("✓ Debug mode %s successfully\n", enable ? "enabled" : "disabled");
          return true;
        } else if (status == STATUS_DEBUG_ERROR) {
          Serial.printf("✗ Error setting debug mode\n");
          return false;
        } else {
          Serial.printf("✓ Debug mode command sent (status: 0x%02X, Pi Pico may not support debug commands yet)\n", status);
          return true; // Assume success for compatibility
        }
      }
    }
    
    Serial.printf("✓ Debug mode command sent (Pi Pico may not support debug commands yet)\n");
    return true; // Assume success if no clear error
  } else {
    Serial.printf("✗ Failed to send debug mode command, error: %d\n", error);
    return false;
  }
}

// Get RTC wakeup interval from Pi Pico (in minutes)
static uint32_t getWakeupInterval() {
  Serial.println("Requesting wakeup interval from Pi Pico...");
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_GET_WAKEUP);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("Failed to send wakeup get command, error: %d\n", error);
    return 0;
  }
  
  delay(50); // Give Pi Pico time to prepare response
  
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 4);
  if (Wire.available() >= 4) {
    uint32_t interval;
    uint8_t* interval_bytes = (uint8_t*)&interval;
    for (int i = 0; i < 4; i++) {
      interval_bytes[i] = Wire.read();
    }
    Serial.printf("✓ Current wakeup interval: %" PRIu32 " minutes\n", interval);
    return interval;
  } else {
    Serial.printf("Failed to read wakeup interval response\n");
    return 0;
  }
}

// Set RTC wakeup interval on Pi Pico (in minutes)
static bool setWakeupInterval(uint32_t minutes) {
  Serial.printf("Setting wakeup interval to %" PRIu32 " minutes...\n", minutes);
  
  if (minutes < 1 || minutes > 43800) {
    Serial.printf("Invalid wakeup interval: %" PRIu32 " (must be 1-43800 minutes)\n", minutes);
    return false;
  }
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_SET_WAKEUP);
  Wire.write((minutes >> 24) & 0xFF);
  Wire.write((minutes >> 16) & 0xFF);
  Wire.write((minutes >> 8) & 0xFF);
  Wire.write(minutes & 0xFF);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("Failed to send wakeup set command, error: %d\n", error);
    return false;
  }
  
  delay(100); // Give Pi Pico time to process
  
  // Check response
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
  if (Wire.available()) {
    uint8_t response = Wire.read();
    if (response == 0x82) {
      Serial.printf("✓ Wakeup interval successfully set to %" PRIu32 " minutes\n", minutes);
      return true;
    } else if (response == 0x83) {
      Serial.printf("Pi Pico rejected wakeup interval: %" PRIu32 " minutes\n", minutes);
      return false;
    } else {
      Serial.printf("Unexpected response from Pi Pico: 0x%02X\n", response);
      return false;
    }
  } else {
    Serial.printf("No response from Pi Pico for set wakeup command\n");
    return false;
  }
}

