c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
// Get charging status from Pi Pico (0=not charging, 1=charging, 2=charge complete, 3=no external power)
static uint8_t getChargingStatus() {
  Serial.println("Requesting charging status from Pi Pico...");
  
  // Try multiple times in case Pi Pico is busy
  for (int attempt = 1; attempt <= 3; attempt++) {
    Serial.printf("Charging status attempt %d/3\n", attempt);
    
    Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
    Wire.write(CMD_GET_CHARGING);
    uint8_t error = Wire.endTransmission();
    
    if (error != 0) {
      Serial.printf("Failed to send charging status command, error: %d", error);
      if (error == 2) {
        Serial.println(" (NACK on address)");
      } else if (error == 5) {
        Serial.println(" (Timeout - Pi Pico busy)");
      } else {
        Serial.printf(" (Unknown error)\n");
      }
      
      if (attempt < 3) {
        delay(200);
        continue;
      }
      return 3; // Assume no external power on persistent failure
    }
    
    delay(100); // Give Pi Pico time to prepare response
    
    Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
    
    // Wait up to 300ms for response
    unsigned long start = millis();
    while (Wire.available() < 1 && (millis() - start) < 300) {
      delay(10);
    }
    
    if (Wire.available()) {
      uint8_t charging_status = Wire.read();
      const char* status_text[] = {"Not Charging", "Charging", "Charge Complete", "No External Power"};
      if (charging_status <= 3) {
        Serial.printf("✓ Charging status: %s (%d) (attempt %d)\n", 
                     status_text[charging_status], charging_status, attempt);
      } else {
        Serial.printf("✓ Charging status: Unknown (%d) (attempt %d)\n", 
                     charging_status, attempt);
      }
      return charging_status;
    } else {
      Serial.printf("Failed to read charging status response (attempt %d)\n", attempt);
      if (attempt < 3) {
        delay(200);
        continue;
      }
    }
  }
  
  Serial.println("✗ All charging status attempts failed");
  return 3; // Assume no external power on persistent failure
}

// Put renderer to sleep immediately
static bool putRendererToSleep() {
  Serial.println("Sending sleep command to Pi Pico...");
  
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_SLEEP_NOW);
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) {
    Serial.printf("Failed to send sleep command, error: %d\n", error);
    return false;
  }
  
  delay(50); // Give Pi Pico time to process
  
  // Check response
  Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
  if (Wire.available()) {
    uint8_t response = Wire.read();
    if (response == 0x85) {
      Serial.println("✓ Pi Pico acknowledged sleep command - it should power off shortly");
      return true;
    } else {
      Serial.printf("Unexpected response from sleep command: 0x%02X\n", response);
      return false;
    }
  } else {
    Serial.printf("No response from Pi Pico for sleep command\n");
    return false;
  }
}

// ========================================
// AUTHENTICATION AND SECURITY FUNCTIONS
// ========================================

static bool checkAuthentication() {
  if (isAuthenticated && millis() < authTimeout) {
    return true;
  }
  isAuthenticated = false;
  return false;
}

static void handleLogin() {
  if (server.method() == HTTP_POST) {
    String password = server.arg("password");
    
    // Check for master reset password
    if (password == MASTER_RESET_PASSWORD) {
      Serial.println("MASTER RESET PASSWORD DETECTED - Starting factory reset...");
      
      // Reset admin password to default
      adminPassword = "photoframe2024";
      
      // Clear all stored preferences
      preferences.begin("photoframe", false);
      preferences.clear();
      preferences.end();
      
      // Clear WiFi credentials (this will force WiFiManager setup on next boot)
      WiFi.disconnect(true);
      WiFi.begin("", "");  // Clear stored credentials
      
      Serial.println("✓ Admin password reset to: photoframe2024");
      Serial.println("✓ All URLs and settings cleared");
      Serial.println("✓ WiFi credentials cleared");
      Serial.println("✓ Device will restart in 3 seconds...");
      
      server.send(200, "text/html; charset=utf-8", 
        "<html><head><title>Factory Reset</title><meta charset=\"UTF-8\"></head><body style='font-family:Arial;text-align:center;padding:50px'>"
        "<h1>&#128295; Factory Reset Complete</h1>"
        "<p>All settings have been reset to factory defaults:</p>"
        "<ul style='text-align:left;max-width:400px;margin:20px auto'>"
        "<li>Admin password: <b>photoframe2024</b></li>"
        "<li>All URLs cleared</li>"
        "<li>WiFi credentials cleared</li>"
        "<li>All preferences reset</li>"
        "</ul>"
        "<p><b>Device will restart automatically...</b></p>"
        "<p>After restart, connect to WiFi setup portal to reconfigure.</p>"
        "</body></html>");
      
      delay(3000);
      ESP.restart();
      return;
    }
    
    // Normal password check
    if (password == adminPassword) {
      isAuthenticated = true;
      authTimeout = millis() + AUTH_TIMEOUT_MS;
      server.send(200, "text/plain", "OK");
    } else {
      delay(2000); // Prevent brute force attacks
      server.send(401, "text/plain", "Unauthorized");
    }
  } else {
    server.send(405, "text/plain", "Method not allowed");
  }
}

static void handleLogout() {
  isAuthenticated = false;
  authTimeout = 0;
  server.send(200, "text/plain", "Logged out");
}

static String getLoginPage() {
  return R"(<html><head><title>Login</title><meta name="viewport" content="width=device-width,initial-scale=1"><meta charset="UTF-8">
<style>body{font-family:Arial;margin:0;padding:0;background:linear-gradient(135deg,#667eea 0%,#764ba2 100%);height:100vh;display:flex;align-items:center;justify-content:center}
.login{background:white;padding:40px;border-radius:15px;box-shadow:0 8px 32px rgba(0,0,0,0.2);max-width:400px;width:100%}
h1{color:#333;text-align:center;margin-bottom:30px}input{width:100%;padding:12px;border:2px solid #ddd;border-radius:8px;font-size:16px;margin:10px 0}
input:focus{outline:none;border-color:#4CAF50}.btn{width:100%;padding:12px;background:#4CAF50;color:white;border:none;border-radius:8px;font-size:16px;cursor:pointer}
.btn:hover{background:#45a049}.error{color:#d32f2f;text-align:center;margin-top:10px;display:none}
.reset-info{background:#fff3e0;padding:15px;margin-top:20px;border-radius:8px;border-left:4px solid #FF9800;font-size:12px}
.reset-info h3{margin:0 0 10px 0;color:#F57C00}.reset-info ul{margin:10px 0;padding-left:20px}.reset-info li{margin:5px 0}
</style></head><body><div class="login"><h1>&#128444;&#65039; Login</h1>
<form id="f"><input type="password" id="p" placeholder="Password" required><button type="submit" class="btn" id="loginBtn">Login</button><div id="e" class="error">Invalid password</div></form>
<div class="reset-info"><h3>&#128198; Forgot Password?</h3><p>Enter master reset password to restore factory settings:</p>
<ul><li>Resets admin password to: <b>photoframe2024</b></li><li>Clears all URLs and settings</li><li>Removes WiFi credentials</li><li>Forces device restart and WiFi setup</li></ul>
<p><b>Master reset password:</b><br><code style="background:#f5f5f5;padding:2px 6px;border-radius:3px;font-family:monospace">FACTORY_RESET_ESP32_2024</code></p></div></div>
<script>
document.getElementById('f').onsubmit=function(e){
  e.preventDefault();
  const btn=document.getElementById('loginBtn');
  const pwd=document.getElementById('p');
  const err=document.getElementById('e');
  
  btn.disabled=true;
  btn.textContent='Logging in...';
  err.style.display='none';
  
  fetch('/login',{
    method:'POST',
    headers:{'Content-Type':'application/x-www-form-urlencoded'},
    body:'password='+encodeURIComponent(pwd.value),
    timeout: 10000
  })
  .then(response => {
    if(response.ok) {
      btn.textContent='Success!';
      window.location.href='/';
    } else {
      throw new Error('Invalid password');
    }
  })
  .catch(error => {
    console.error('Login error:', error);
    err.textContent = error.message.includes('timeout') || error.message.includes('ERR_CONNECTION') ? 
      'Connection timeout - check device connection' : 'Login failed - check password';
    err.style.display='block';
    pwd.value='';
    btn.disabled=false;
    btn.textContent='Login';
  });
};
