c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
</script></body></html>)";
}

// ========================================
// FIRMWARE UPDATE FUNCTIONS
// ========================================

static void handleFirmwareUpdate() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  HTTPUpload& upload = server.upload();
  
  if (upload.status == UPLOAD_FILE_START) {
    Serial.printf("Firmware update started: %s\n", upload.filename.c_str());
    
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
      Update.printError(Serial);
      server.send(500, "text/plain", "Update failed to start");
      return;
    }
  } 
  else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      Update.printError(Serial);
      server.send(500, "text/plain", "Update write failed");
      return;
    }
  } 
  else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) {
      Serial.printf("Firmware update success: %u bytes\n", upload.totalSize);
      server.send(200, "text/plain", "Update successful! Device will restart in 3 seconds.");
      delay(3000);
      ESP.restart();
    } else {
      Update.printError(Serial);
      server.send(500, "text/plain", "Update failed to complete");
    }
  }
}

// ========================================
// URL MANAGEMENT FUNCTIONS
// ========================================

// Save battery data to persistent storage with wear leveling
static void saveBatteryData() {
  // Use same wear leveling as URL storage
  String namespace_base = "pf";
  uint32_t current_cycle = write_cycle_counter;
  String active_namespace = namespace_base + String(current_cycle % 8);
  
  preferences.begin(active_namespace.c_str(), false);
  preferences.putUInt("displayCycles", display_cycle_count);
  preferences.putUChar("lastCharging", current_charging_status);
  
  // Save last known voltage if valid
  if (current_battery_voltage > 0) {
    preferences.putFloat("lastVoltage", current_battery_voltage);
  }
  preferences.end();
  
  Serial.printf("Saved battery data to %s: %d cycles, charging state %d, voltage %.3fV\n", 
               active_namespace.c_str(), display_cycle_count, current_charging_status, current_battery_voltage);
}

// Initialize URL storage and load existing URLs with wear leveling support
static void initUrlStorage() {
  Serial.println("Initializing wear-leveled URL storage...");
  
  // FLASH WEAR LEVELING: Find the most recent namespace with valid data
  String namespace_base = "pf";
  uint32_t highest_cycle = 0;
  String active_namespace = "photoframe"; // Fallback to old namespace
  bool found_wear_leveled = false;
  
  // Check all 8 wear-leveling namespaces to find the newest one
  for (int ns = 0; ns < 8; ns++) {
    String test_namespace = namespace_base + String(ns);
    preferences.begin(test_namespace.c_str(), true); // Read-only
    
    uint32_t cycle = preferences.getInt("writeCycle", 0);
    if (cycle > 0 && cycle > highest_cycle) {
      highest_cycle = cycle;
      active_namespace = test_namespace;
      found_wear_leveled = true;
    }
    preferences.end();
  }
  
  if (found_wear_leveled) {
    write_cycle_counter = highest_cycle;
    Serial.printf("Found wear-leveled data in namespace: %s (cycle %d)\n", active_namespace.c_str(), highest_cycle);
  } else {
    // Check old "photoframe" namespace for migration
    preferences.begin("photoframe", true);
    int old_count = preferences.getInt("urlCount", 0);
    preferences.end();
    
    if (old_count > 0) {
      Serial.println("Migrating from old storage format to wear-leveled storage...");
      active_namespace = "photoframe";
      write_cycle_counter = 1; // Start wear leveling
    }
  }
  
  // Load data from the active namespace
  preferences.begin(active_namespace.c_str(), false);
  urlCount = preferences.getInt("urlCount", 0);
  currentUrlIndex = preferences.getInt("currentIdx", 0);
  
  if (urlCount == 0) {
    // First time setup - add default URL
    Serial.println("No URLs found - adding default URL");
    imageUrls[0] = "https://raw.githubusercontent.com/FloThinksPi/PhotoPainter-ESP32/refs/heads/main/ImageConverter/Examples/arabella.bmp";
    urlCount = 1;
    currentUrlIndex = 0;
    preferences.end();
    saveUrls(); // This will use wear leveling
  } else {
    // Load existing URLs
    for (int i = 0; i < urlCount && i < MAX_URLS; i++) {
      String key = "url" + String(i);
      imageUrls[i] = preferences.getString(key.c_str(), "");
      Serial.printf("Loaded URL %d: %s\n", i, imageUrls[i].c_str());
    }
    preferences.end();
    
    // If we migrated from old format, save with wear leveling now
    if (!found_wear_leveled && urlCount > 0) {
      Serial.println("Converting to wear-leveled storage...");
      saveUrls();
    }
  }
  
  // Validate current index
  if (currentUrlIndex >= urlCount) {
    currentUrlIndex = 0;
  }
  
  // Load admin password with wear leveling support
  adminPassword = "photoframe2024"; // Default
  bool password_found = false;
  
  // Check wear-leveled admin namespaces (newest first)
  for (int cycle = (write_cycle_counter / 4); cycle >= 0 && cycle > (write_cycle_counter / 4) - 4; cycle--) {
    String admin_namespace = "admin" + String(cycle % 4);
    preferences.begin(admin_namespace.c_str(), true);
    String stored_password = preferences.getString("password", "");
    preferences.end();
    
    if (stored_password.length() > 0) {
      adminPassword = stored_password;
      password_found = true;
      Serial.printf("✓ Admin password loaded from wear-leveled namespace: %s\n", admin_namespace.c_str());
      break;
    }
  }
  
  // Fallback to old namespace if no wear-leveled password found
  if (!password_found) {
    preferences.begin("photoframe", true);
    String old_password = preferences.getString("password", "");
    preferences.end();
    
    if (old_password.length() > 0) {
      adminPassword = old_password;
      Serial.println("✓ Admin password loaded from legacy storage");
    }
  }
  
  Serial.printf("✓ URL storage initialized: %d URLs, current index: %d\n", urlCount, currentUrlIndex);
}

// Save URLs to persistent storage
static void saveUrls() {
  // FLASH WEAR LEVELING: Distribute writes across different namespaces
  // This prevents wearing out the same flash sectors by rotating storage locations
  String namespace_base = "pf"; // Short namespace for efficiency
  String namespace_name = namespace_base + String(write_cycle_counter % 8); // Rotate across 8 namespaces
  
  write_cycle_counter++; // Increment for next write cycle
  
  Serial.printf("Using wear-leveled namespace: %s (cycle %d)\n", namespace_name.c_str(), write_cycle_counter);
  
  preferences.end(); // Close current namespace
  preferences.begin(namespace_name.c_str(), false); // Open rotated namespace
  
  preferences.putInt("urlCount", urlCount);
  preferences.putInt("currentIdx", currentUrlIndex);
  preferences.putInt("writeCycle", write_cycle_counter); // Store cycle counter for recovery
  
