c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
  html += "<h1>&#128248; PhotoFrame Control Panel</h1><button class=\"logout\" onclick=\"logout()\">Logout</button>";
  html += "<div class=\"card\"><h2>&#128202; System Status</h2>";
  
  // Enhanced battery status with percentage and cycle count
  int battery_percentage = calculateBatteryPercentage(current_battery_voltage);
  String battery_color = (current_battery_voltage > 3.5f) ? "good" : (current_battery_voltage > 3.2f) ? "low" : "crit";
  String percentage_indicator = "";
  
  // Add visual battery percentage indicator
  if (battery_percentage >= 75) {
    percentage_indicator = "🔋"; // Full battery
  } else if (battery_percentage >= 50) {
    percentage_indicator = "🔋"; // Medium battery 
  } else if (battery_percentage >= 25) {
    percentage_indicator = "🪫"; // Low battery
  } else {
    percentage_indicator = "🪫"; // Critical battery
  }
  
  html += "<div class=\"i\">" + percentage_indicator + " Battery: <span class=\"" + battery_color + "\">" + 
          String(current_battery_voltage, 3) + "V (" + String(battery_percentage) + "%)</span> | " +
          "&#9889; Charging: " + String((current_charging_status == 0) ? "Not Charging" : 
          (current_charging_status == 1) ? "Charging" : (current_charging_status == 2) ? 
          "Charge Complete" : "No External Power") + "</div>";
  
  html += "<div class=\"i\">&#128472; Display Cycles: " + String(display_cycle_count) + " | " +
          "&#9200; Wakeup: " + String(current_wakeup_interval) + " min | " +
          "&#128295; Debug: " + String(current_debug_mode ? "ON" : "OFF") + " | " +
          "&#127760; IP: " + ipAddress + " | &#128193; URLs: " + String(urlCount) + 
          " (current: #" + String(currentUrlIndex + 1) + ")</div></div>";
  
  // Add WiFi configuration section if in AP mode
  if (WiFi.getMode() == WIFI_AP || WiFi.getMode() == WIFI_AP_STA) {
    html += "<div class=\"card\"><h2>&#128246; WiFi Configuration</h2>";
    html += "<div class=\"i\">&#128246; Current Mode: Access Point (AP)</div>";
    html += "<div class=\"i\">&#128246; AP SSID: ESP32PhotoFrame</div>";
    html += "<div class=\"i\">&#127760; AP IP: " + WiFi.softAPIP().toString() + "</div>";
    html += "<button class=\"refresh\" onclick=\"scanWifi()\" id=\"scan-btn\">&#128250; Scan Networks</button>";
    html += "<div id=\"wifi-networks\" style=\"margin-top:10px;\"></div>";
    html += "<div id=\"wifi-form\" style=\"display:none;margin-top:10px;\">";
    html += "<div class=\"f\">";
    html += "<input type=\"text\" id=\"ssid\" placeholder=\"WiFi Network Name\" style=\"margin-bottom:10px;\">";
    html += "<input type=\"password\" id=\"wifi-password\" placeholder=\"WiFi Password\" style=\"margin-bottom:10px;\">";
    html += "<button class=\"add\" onclick=\"connectWifi()\" id=\"connect-btn\">&#128246; Connect to WiFi</button>";
    html += "<button class=\"del\" onclick=\"hideWifiForm()\">&#10006; Cancel</button>";
    html += "</div></div>";
    html += "<div id=\"wifi-status\"></div></div>";
  } else if (WiFi.status() == WL_CONNECTED) {
    html += "<div class=\"card\"><h2>&#128246; WiFi Status</h2>";
    html += "<div class=\"i\">&#9989; Connected to: " + WiFi.SSID() + "</div>";
    html += "<div class=\"i\">&#127760; IP Address: " + WiFi.localIP().toString() + "</div>";
    html += "<div class=\"i\">&#128246; Signal Strength: " + String(WiFi.RSSI()) + " dBm</div>";
    html += "</div>";
  }
  
  html += "<div class=\"control-section\"><h2>&#127918; Manual Controls</h2>";
  html += "<button class=\"display\" onclick=\"displayCurrent()\">&#128444; Display Current Image</button>";
  html += "<button class=\"next\" onclick=\"nextImage()\">&#9197; Next Image</button>";
  html += "<div id=\"control-status\"></div></div>";
  
  html += "<div class=\"f\"><h2>&#128279; Image URLs</h2>" + urlListHtml;
  html += "<div style=\"display:flex;gap:10px;margin-top:10px\">";
  html += "<input type=\"text\" id=\"url\" placeholder=\"https://example.com/image.jpg\" style=\"flex:1\">";
  html += "<button class=\"add\" onclick=\"addUrl()\" style=\"min-width:80px\">&#10133; Add</button></div></div>";
  
  html += "<div class=\"f\"><h2>&#9881; Configuration</h2>";
  html += "<input type=\"number\" id=\"wake\" min=\"1\" max=\"43800\" value=\"" + String(current_wakeup_interval) + "\" placeholder=\"Wakeup interval (1-43800 minutes)\">";
  html += "<button onclick=\"update()\">&#128190; Update</button><button onclick=\"refreshPage()\">&#128472; Refresh</button>";
  html += "<div style=\"margin-top:10px;display:flex;align-items:center;gap:10px\">";
  html += "<input type=\"checkbox\" id=\"debug-toggle\" " + String(current_debug_mode ? "checked" : "") + " onchange=\"toggleDebugMode()\">";
  html += "<label for=\"debug-toggle\">Debug Mode</label>";
  html += "</div></div>";
  
  html += "<div class=\"sec\"><h2>&#128274; Security</h2>";
  html += "<input type=\"password\" id=\"pwd\" placeholder=\"New Password (8+ characters)\">";
  html += "<button onclick=\"changePwd()\">&#128273; Change Password</button></div>";
  
  html += "<div class=\"up\"><h2>&#128193; Firmware Upload</h2>";
  html += "<input type=\"file\" id=\"fw\" accept=\".bin\"><button onclick=\"upload()\">&#11014; Upload Firmware</button><div id=\"upload-status\"></div></div>";
  
  html += "<div style=\"text-align:center;color:#666;margin-top:20px\">v2.4 | &#9201; " + String(millis() / 1000) + " sec | &#128190; " + String(ESP.getFreeHeap()) + " bytes free</div></div>";
  
  // Add JavaScript functions
  html += "<script>";
  html += "function logout(){fetch('/logout',{method:'POST'}).then(()=>location.reload())}";
  html += "function update(){const i=document.getElementById('wake').value;if(i>=1&&i<=43800)fetch('/setWakeup',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'minutes='+i}).then(r=>r.text()).then(d=>{showStatus(d,d.includes('success'));if(d.includes('success'))setTimeout(refreshPage,1500)});else showStatus('Please enter 1-43800 minutes',false)}";
  html += "function toggleDebugMode(){const checkbox=document.getElementById('debug-toggle');const enabled=checkbox.checked;checkbox.disabled=true;fetch('/setDebugMode',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'enable='+(enabled?'true':'false')}).then(r=>r.text()).then(d=>{showStatus(d,d.includes('success'));checkbox.disabled=false;if(!d.includes('success')){checkbox.checked=!enabled}}).catch(e=>{showStatus('Failed to set debug mode',false);checkbox.disabled=false;checkbox.checked=!enabled})}";
  html += "function updateDebugButton(){}"; // Keep for compatibility but make it empty
  html += "function deleteUrl(i){if(confirm('Delete this URL?'))fetch('/deleteUrl',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'index='+i}).then(r=>r.text()).then(d=>{console.log('Delete response:',d);showStatus(d,d.includes('success'));if(d.includes('success'))setTimeout(refreshPage,1500)}).catch(e=>{console.error('Delete error:',e);showStatus('Failed to delete URL',false)})}";
  html += "function addUrl(){const u=document.getElementById('url').value;if(u)fetch('/addUrl',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'url='+encodeURIComponent(u)}).then(r=>r.text()).then(d=>{showStatus(d,d.includes('success'));if(d.includes('success')){document.getElementById('url').value='';setTimeout(refreshPage,1500)}});else showStatus('Please enter a URL',false)}";
  html += "function displayImage(i){document.getElementById('control-status').innerHTML='&#128444; Displaying image #'+(i+1)+'...';fetch('/displayImage',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'index='+i}).then(r=>r.text()).then(d=>{showControlStatus(d,d.includes('success'));if(d.includes('success'))setTimeout(refreshPage,2000)})}";
  html += "function displayCurrent(){document.getElementById('control-status').innerHTML='&#128444; Displaying current image...';fetch('/displayCurrent',{method:'POST'}).then(r=>r.text()).then(d=>{showControlStatus(d,d.includes('success'))})}";
  html += "function nextImage(){document.getElementById('control-status').innerHTML='&#9197; Loading next image...';fetch('/nextImage',{method:'POST'}).then(r=>r.text()).then(d=>{showControlStatus(d,d.includes('success'));if(d.includes('success'))setTimeout(refreshPage,2000)})}";
  html += "function changePwd(){const p=document.getElementById('pwd').value;if(p.length>=8)fetch('/changePassword',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:'password='+encodeURIComponent(p)}).then(r=>r.text()).then(d=>{showStatus(d,d.includes('success'));document.getElementById('pwd').value=''});else showStatus('Password must be at least 8 characters',false)}";
  html += "function upload(){const f=document.getElementById('fw').files[0];if(!f||!f.name.endsWith('.bin')||f.size>2000000){showUploadStatus('Please select a valid .bin file under 2MB',false);return}if(!confirm('Upload firmware? Device will restart!'))return;const fd=new FormData();fd.append('firmware',f);showUploadStatus('&#128228; Uploading firmware...',true);fetch('/firmware',{method:'POST',body:fd}).then(r=>r.text()).then(d=>showUploadStatus(d,d.includes('success'))).catch(e=>showUploadStatus('X Upload failed',false))}";
  html += "function refreshPage(){location.reload()}";
  html += "function showStatus(msg,success){const div=document.createElement('div');div.className='status-msg '+(success?'status-success':'status-error');div.innerHTML=msg;document.body.appendChild(div);setTimeout(()=>div.remove(),4000)}";
  html += "function showControlStatus(msg,success){document.getElementById('control-status').innerHTML='<div class=\"status-msg '+(success?'status-success':'status-error')+'\">'+msg+'</div>';setTimeout(()=>document.getElementById('control-status').innerHTML='',4000)}";
  html += "function showUploadStatus(msg,isProgress){document.getElementById('upload-status').innerHTML='<div class=\"status-msg '+(isProgress?'status-success':'status-error')+'\">'+msg+'</div>'}";
  html += "function showWifiStatus(msg,success){document.getElementById('wifi-status').innerHTML='<div class=\"status-msg '+(success?'status-success':'status-error')+'\">'+msg+'</div>';setTimeout(()=>document.getElementById('wifi-status').innerHTML='',success?8000:4000)}";
  html += "function scanWifi(){document.getElementById('scan-btn').innerHTML='&#128250; Scanning...';document.getElementById('scan-btn').disabled=true;fetch('/scanWifi').then(r=>r.json()).then(networks=>{let html='<div style=\"background:#f9f9f9;border:1px solid #ddd;border-radius:5px;max-height:200px;overflow-y:auto;margin:10px 0;\">';networks.forEach((net,i)=>{const strength=net.rssi>-60?'&#128246;':net.rssi>-70?'&#128246;':'&#128246;';const security=net.encryption?'&#128274;':'&#128275;';html+=`<div style=\"padding:8px;border-bottom:1px solid #eee;cursor:pointer;\" onclick=\"selectNetwork('${net.ssid.replace(/'/g,\"\\\\\\\\'\")}',${net.encryption})\"><strong>${net.ssid}</strong> ${strength} ${security} (${net.rssi} dBm)</div>`});html+='</div>';html+='<button onclick=\"showWifiForm()\" style=\"background:#4CAF50;color:white;border:none;padding:8px 16px;border-radius:4px;cursor:pointer;\">&#10133; Add Network Manually</button>';document.getElementById('wifi-networks').innerHTML=html;document.getElementById('scan-btn').innerHTML='&#128250; Scan Networks';document.getElementById('scan-btn').disabled=false}).catch(e=>{showWifiStatus('Scan failed',false);document.getElementById('scan-btn').innerHTML='&#128250; Scan Networks';document.getElementById('scan-btn').disabled=false})}";
  html += "function selectNetwork(ssid,encrypted){document.getElementById('ssid').value=ssid;document.getElementById('wifi-form').style.display='block';if(!encrypted)document.getElementById('wifi-password').style.display='none';else document.getElementById('wifi-password').style.display='block'}";
  html += "function showWifiForm(){document.getElementById('wifi-form').style.display='block';document.getElementById('ssid').value='';document.getElementById('wifi-password').value='';document.getElementById('wifi-password').style.display='block'}";
  html += "function hideWifiForm(){document.getElementById('wifi-form').style.display='none'}";
  html += "function connectWifi(){const ssid=document.getElementById('ssid').value;const pass=document.getElementById('wifi-password').value;if(!ssid){showWifiStatus('Please enter WiFi name',false);return}document.getElementById('connect-btn').innerHTML='&#128246; Connecting...';document.getElementById('connect-btn').disabled=true;fetch('/connectWifi',{method:'POST',headers:{'Content-Type':'application/x-www-form-urlencoded'},body:`ssid=${encodeURIComponent(ssid)}&password=${encodeURIComponent(pass)}`}).then(r=>r.text()).then(d=>{showWifiStatus(d,d.includes('Connected'));if(d.includes('Connected')){setTimeout(()=>{showWifiStatus('Switching to WiFi mode... Please reconnect to new IP address',true);setTimeout(refreshPage,3000)},2000)}document.getElementById('connect-btn').innerHTML='&#128246; Connect to WiFi';document.getElementById('connect-btn').disabled=false}).catch(e=>{showWifiStatus('Connection failed',false);document.getElementById('connect-btn').innerHTML='&#128246; Connect to WiFi';document.getElementById('connect-btn').disabled=false})}";
  html += "</script></body></html>";
  
  // Debug: Check HTML length
  Serial.printf("✓ HTML generated successfully: %d bytes\n", html.length());
  
