c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
  return html.c_str();
}

// Web server handlers
static void handleRoot() {
  Serial.println("📡 HTTP request received to /");
  
  // Check authentication and serve full UI (only when connected to WiFi)
  if (!checkAuthentication()) {
    server.send(200, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  // Update status from Pi Pico (with error handling)
  Serial.println("Updating status from Pi Pico...");
  
  float new_battery_voltage = getBatteryVoltage();
  if (new_battery_voltage > 0) {
    current_battery_voltage = new_battery_voltage;
  }
  
  uint32_t new_wakeup_interval = getWakeupInterval();
  if (new_wakeup_interval > 0) {
    current_wakeup_interval = new_wakeup_interval;
  }
  
  uint8_t new_charging_status = getChargingStatus();
  if (new_charging_status <= 3) { // Valid range 0-3
    current_charging_status = new_charging_status;
  }
  
  // Debug mode - safe to call even if Pi Pico doesn't support it yet
  // Only update current_debug_mode if we get a valid response from Pi Pico
  // to preserve user settings when Pi Pico doesn't support debug commands
  Wire.beginTransmission(PI_PICO_I2C_ADDRESS);
  Wire.write(CMD_GET_DEBUG_STATUS);
  uint8_t debug_error = Wire.endTransmission();
  
  if (debug_error == 0) {
    // Only try to read if the command was sent successfully
    delay(100);
    Wire.requestFrom(PI_PICO_I2C_ADDRESS, 1);
    unsigned long debug_start = millis();
    while (Wire.available() < 1 && (millis() - debug_start) < 200) {
      delay(10);
    }
    
    if (Wire.available() >= 1) {
      uint8_t debug_response = Wire.read();
      if (debug_response == 0x88 || debug_response == 0 || debug_response == 1) {
        // Valid response - update current_debug_mode
        bool new_debug_mode = (debug_response == 1) || (debug_response == 0x88);
        current_debug_mode = new_debug_mode;
      }
      // If invalid response, keep current_debug_mode as is
    }
    // If no response, keep current_debug_mode as is
  }
  // If command failed, keep current_debug_mode as is
  
  // Send battery info to display for overlay
  if (current_battery_voltage > 0.0f) {
    sendBatteryInfoToDisplay(current_battery_voltage, display_cycle_count);
  }
  
  last_status_update = millis();
  
  server.send(200, "text/html; charset=utf-8", getWebUI());
}

static void handleSetWakeup() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("minutes")) {
    uint32_t minutes = server.arg("minutes").toInt();
    
    if (setWakeupInterval(minutes)) {
      current_wakeup_interval = minutes;
      server.send(200, "text/plain", "Wakeup interval updated successfully!");
    } else {
      server.send(400, "text/plain", "Failed to update wakeup interval");
    }
  } else {
    server.send(400, "text/plain", "Missing minutes parameter");
  }
}

static void handleSetDebugMode() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("enable")) {
    bool enable = (server.arg("enable") == "true" || server.arg("enable") == "1");
    
    if (setDebugMode(enable)) {
      current_debug_mode = enable;
      String message = String("Debug mode ") + (enable ? "enabled" : "disabled") + " successfully!";
      server.send(200, "text/plain", message);
    } else {
      server.send(400, "text/plain", "Failed to set debug mode");
    }
  } else {
    server.send(400, "text/plain", "Missing enable parameter");
  }
}

static void handleAddUrl() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("url")) {
    String url = server.arg("url");
    
    if (addUrl(url)) {
      server.send(200, "text/plain", "URL added successfully!");
    } else {
      server.send(400, "text/plain", "Failed to add URL (duplicate, too long, or maximum reached)");
    }
  } else {
    server.send(400, "text/plain", "Missing URL parameter");
  }
}

static void handleDeleteUrl() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("index")) {
    int index = server.arg("index").toInt();
    
    if (removeUrl(index)) {
      server.send(200, "text/plain", "URL deleted successfully!");
    } else {
      server.send(400, "text/plain", "Failed to delete URL (invalid index)");
    }
  } else {
    server.send(400, "text/plain", "Missing index parameter");
  }
}

static void handleChangePassword() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (server.hasArg("password")) {
    String newPassword = server.arg("password");
    
    if (newPassword.length() >= 8) {
      adminPassword = newPassword;
      saveAdminSettings(); // Use wear-leveled storage
      
      server.send(200, "text/plain", "Password changed successfully!");
      Serial.println("Admin password updated with wear leveling");
    } else {
      server.send(400, "text/plain", "Password must be at least 8 characters long");
    }
  } else {
    server.send(400, "text/plain", "Missing password parameter");
  }
}

static void handleDisplayCurrent() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
  last_status_update = millis();
  
  if (urlCount > 0) {
    Serial.println("🖼️ Manual display request - displaying current image");
    
    bool success = downloadAndConvertBmpImage(imageUrls[currentUrlIndex].c_str());
    
    if (success) {
      server.send(200, "text/plain", "✓ Displaying current image: " + imageUrls[currentUrlIndex]);
    } else {
      server.send(500, "text/plain", "❌ Failed to display image: " + imageUrls[currentUrlIndex]);
    }
  } else {
    server.send(400, "text/plain", "❌ No URLs configured");
  }
}

static void handleDisplayImage() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
