c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
  if (!server.hasArg("index")) {
    server.send(400, "text/plain", "❌ Missing index parameter");
    return;
  }
  
  int index = server.arg("index").toInt();
  
  if (index < 0 || index >= urlCount) {
    server.send(400, "text/plain", "❌ Invalid URL index: " + String(index));
    return;
  }
  
  last_status_update = millis();
  
  Serial.printf("🖼️ Manual display request - showing image %d/%d\n", index + 1, urlCount);
  
  bool success = downloadAndConvertBmpImage(imageUrls[index].c_str());
  
  if (success) {
    // Update current index to the displayed image with wear leveling
    currentUrlIndex = index;
    saveUrls(); // Use wear-leveled storage instead of direct write
    
    server.send(200, "text/plain", "✓ Displaying image " + String(index + 1) + "/" + String(urlCount) + ": " + imageUrls[index]);
  } else {
    server.send(500, "text/plain", "❌ Failed to display image " + String(index + 1) + ": " + imageUrls[index]);
  }
}

static void handleNextImage() {
  if (!checkAuthentication()) {
    server.send(401, "text/plain", "Unauthorized");
    return;
  }
  
  last_status_update = millis();
  
  if (urlCount > 0) {
    // Advance to next URL
    currentUrlIndex = (currentUrlIndex + 1) % urlCount;
    
    // Save current index with wear leveling
    saveUrls(); // Use wear-leveled storage instead of direct write
    
    Serial.printf("⏭️ Manual next image - advancing to URL %d/%d\n", currentUrlIndex + 1, urlCount);
    
    bool success = downloadAndConvertBmpImage(imageUrls[currentUrlIndex].c_str());
    
    if (success) {
      server.send(200, "text/plain", "✓ Loading next image (" + String(currentUrlIndex + 1) + "/" + String(urlCount) + "): " + imageUrls[currentUrlIndex]);
    } else {
      server.send(500, "text/plain", "❌ Failed to load next image: " + imageUrls[currentUrlIndex]);
    }
  } else {
    server.send(400, "text/plain", "❌ No URLs configured");
  }
}

static void handleNotFound() {
  String message = "Page not found\n";
  message += "URI: " + server.uri() + "\n";
  message += "Method: " + String(server.method()) + "\n";
  message += "Arguments: " + String(server.args()) + "\n";
  message += "\nAvailable endpoints:\n";
  message += "/ - Main interface\n";
  message += "/test - Simple test page\n";
  server.send(404, "text/plain", message);
}

// Simple test handler for debugging connectivity
static void handleTest() {
  String response = "ESP32PhotoFrame Test Page\n\n";
  response += "✅ Web server is working!\n";
  response += "Time: " + String(millis()) + " ms\n";
  response += "Free heap: " + String(ESP.getFreeHeap()) + " bytes\n";
  
  if (WiFi.getMode() == WIFI_AP || WiFi.getMode() == WIFI_AP_STA) {
    response += "Mode: Access Point\n";
    response += "AP IP: " + WiFi.softAPIP().toString() + "\n";
    response += "Connected clients: " + String(WiFi.softAPgetStationNum()) + "\n";
  }
  
  if (WiFi.status() == WL_CONNECTED) {
    response += "WiFi: Connected\n";
    response += "STA IP: " + WiFi.localIP().toString() + "\n";
  }
  
  server.send(200, "text/plain", response);
}

// WiFi management handlers
static void handleScanWifi() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  Serial.println("📡 Scanning for WiFi networks...");
  int networks = WiFi.scanNetworks();
  
  String json = "[";
  for (int i = 0; i < networks; i++) {
    if (i > 0) json += ",";
    json += "{";
    json += "\"ssid\":\"" + WiFi.SSID(i) + "\",";
    json += "\"rssi\":" + String(WiFi.RSSI(i)) + ",";
    json += "\"encryption\":" + String((WiFi.encryptionType(i) == WIFI_AUTH_OPEN) ? 0 : 1);
    json += "}";
  }
  json += "]";
  
  Serial.printf("✓ Found %d networks\n", networks);
  server.send(200, "application/json", json);
}

static void handleConnectWifi() {
  if (!checkAuthentication()) {
    server.send(401, "text/html; charset=utf-8", getLoginPage());
    return;
  }
  
  if (!server.hasArg("ssid") || !server.hasArg("password")) {
    server.send(400, "text/plain", "Missing SSID or password");
    return;
  }
  
  String ssid = server.arg("ssid");
  String password = server.arg("password");
  
  Serial.printf("🔗 Attempting to connect to WiFi: %s\n", ssid.c_str());
  
  // If we're in AP mode, we need to switch to AP+STA mode
  if (WiFi.getMode() == WIFI_AP) {
    WiFi.mode(WIFI_AP_STA);
    delay(100); // Brief delay for mode switch
  }
  
  WiFi.begin(ssid.c_str(), password.c_str());
  
  // Wait up to 20 seconds for connection
  int timeout = 20;
  while (WiFi.status() != WL_CONNECTED && timeout > 0) {
    delay(1000);
    timeout--;
    Serial.print(".");
  }
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.println("\n✅ WiFi connected successfully!");
    Serial.printf("IP address: %s\n", WiFi.localIP().toString().c_str());
    
    // Save credentials to preferences for persistence
    preferences.begin("wifi", false);
    preferences.putString("ssid", ssid);
    preferences.putString("password", password);
    preferences.end();
    Serial.println("✓ WiFi credentials saved for next boot");
    
    server.send(200, "text/plain", "✅ Connected to " + ssid + "! IP: " + WiFi.localIP().toString() + 
                "\n\nCredentials saved. The device will now switch to WiFi mode.\n" +
                "Please reconnect to the new IP address: " + WiFi.localIP().toString());
  } else {
    Serial.println("\n❌ WiFi connection failed");
    server.send(400, "text/plain", "❌ Failed to connect to " + ssid + 
                "\n\nPlease check the network name and password and try again.");
  }
}

// Initialize web server
static void setupWebServer() {
  Serial.println("🌐 Setting up web server...");
  
  // Only set up the custom web server when connected to WiFi (not in AP mode)
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("⚠ WiFi not connected - skipping custom web server setup");
    return;
  }
  
  // Stop any existing server instance
  server.stop();
  server.close();
  
  delay(100); // Brief delay before restart
  
  Serial.println("🌐 Configuring web server routes...");
  
  server.on("/", handleRoot);
  server.on("/test", HTTP_GET, handleTest);
  server.on("/login", HTTP_POST, handleLogin);
  server.on("/logout", HTTP_POST, handleLogout);
  
  // Admin and control handlers
  server.on("/setWakeup", HTTP_POST, handleSetWakeup);
  server.on("/setDebugMode", HTTP_POST, handleSetDebugMode);
  server.on("/addUrl", HTTP_POST, handleAddUrl);
  server.on("/deleteUrl", HTTP_POST, handleDeleteUrl);
  server.on("/displayCurrent", HTTP_POST, handleDisplayCurrent);
  server.on("/displayImage", HTTP_POST, handleDisplayImage);
  server.on("/nextImage", HTTP_POST, handleNextImage);
  server.on("/changePassword", HTTP_POST, handleChangePassword);
  server.on("/scanWifi", HTTP_GET, handleScanWifi);
  server.on("/connectWifi", HTTP_POST, handleConnectWifi);
  server.on("/firmware", HTTP_POST, []() {
    server.send(200, "text/plain", "");
  }, handleFirmwareUpdate);
  
