c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
  // Handle 404
  server.onNotFound(handleNotFound);
  
  server.begin(80); // Explicitly specify port 80
  
  Serial.println("✓ Custom web server started on port 80");
  Serial.printf("✓ Access control panel at: http://%s\n", WiFi.localIP().toString().c_str());
}

void setup() {
  Serial.begin(115200);
  Serial.println("=== ESP32 I2C IMAGE FETCHER ===");
  
  // Display ESP32 hardware information
  printESP32ModelInfo();
  
  // Initialize URL storage first
  initUrlStorage();
  
  // Initialize I2C communication first to check charging status
  Serial.println("Initializing I2C for charging status check...");
  if (!initI2C()) {
    Serial.println("FATAL: I2C initialization failed!");
  }
  
  // Wait for Pi Pico to fully initialize I2C slave and battery sampling
  Serial.println("Waiting for Pi Pico I2C slave and battery sampling to initialize...");
  delay(3000); // 3 second startup delay for reliable I2C communication and battery stabilization
  Serial.println("✓ I2C slave and battery sampling initialization period complete");
  
  // Check charging status to determine WiFi behavior
  uint8_t charging_status = getChargingStatus();
  current_charging_status = charging_status;
  
  bool should_enable_wifi = false;
  
  if (charging_status == 1 || charging_status == 2) {
    // Charging or charge complete - enable WiFi services
    Serial.println("🔌 Device is charging/charged - enabling WiFi configuration services");
    should_enable_wifi = true;
  } else {
    // No external power or not charging - battery mode only
    Serial.println("🔋 Battery mode detected - skipping WiFi to save power");
    Serial.println("WiFi config portal and web server will be disabled to maximize battery life");
    should_enable_wifi = false;
  }
  
  // WiFi initialization based on charging status
  if (should_enable_wifi) {
    Serial.println("Initializing WiFi Manager (CHARGING MODE - full features enabled)...");
    
    // Configure WiFiManager before any connection attempts
    wm.setAPStaticIPConfig(IPAddress(192,168,0,1), IPAddress(192,168,0,1), IPAddress(255,255,255,0));
    wm.setConnectTimeout(10); // Short timeout for initial connection attempt
    wm.setConfigPortalBlocking(false);
    wm.setConfigPortalTimeout(0); // Disable portal timeout for the initial autoConnect
    
    Serial.println("Attempting to connect to saved WiFi...");
    if (wm.autoConnect("ESP32PhotoFrame")) {
      Serial.println("✓ WiFi connected successfully");
      Serial.printf("IP address: %s\n", WiFi.localIP().toString().c_str());
      
      // Print ESP32 model information on startup
      printESP32ModelInfo();
      
      // Keep WiFi in low power mode even when charging for energy efficiency
      Serial.println("🔌 CHARGING MODE: Maintaining WiFi low power mode for energy efficiency");
      WiFi.setAutoReconnect(true);
      WiFi.persistent(true);
      Serial.println("✓ WiFi low power optimizations enabled for charging mode");
      
      // Initialize web server for configuration
      setupWebServer();
    } else {
      Serial.println("WiFi connection failed - WiFiManager portal is already active");
      Serial.println("🌐 WiFiManager configuration portal is running");
      Serial.println("📱 Connect to 'ESP32PhotoFrame' hotspot to configure WiFi");
      Serial.println("🌐 Portal is available at: http://192.168.0.1");
      
      // The portal is already running from autoConnect(), so we just need to wait
      // Set up a callback to know when WiFi gets connected
      wm.setSaveConfigCallback([](){
        Serial.println("✓ WiFi configuration saved via portal");
      });
      
      // Don't go to sleep - let the portal run in the main loop via wm.process()
      Serial.println("📡 Portal is active - waiting for WiFi configuration...");
      Serial.println("� Device will stay awake while portal is active");
    }
  } else {
    // Battery mode - attempt WiFi connection, then sleep if failed
    Serial.println("Attempting WiFi connection (BATTERY MODE - 30s timeout)...");
    
    wm.setConnectTimeout(30); // 30s timeout for battery mode
    wm.setConfigPortalTimeout(0); // Disable config portal completely in battery mode
    wm.setConfigPortalBlocking(false);
    
    if (wm.autoConnect("ESP32PhotoFrame")) {
      Serial.println("✓ Quick WiFi connection successful");
      Serial.printf("IP address: %s\n", WiFi.localIP().toString().c_str());
      
      // Keep low power mode active for battery conservation
      Serial.println("🔋 BATTERY MODE: Maintaining WiFi low power mode for energy efficiency");
      // Initialize web server for configuration even in battery mode when connected
      setupWebServer();
    } else {
      Serial.println("❌ WiFi connection failed - entering deep sleep to save battery");
      Serial.println("� BATTERY MODE: No WiFi connection - conserving battery power");
      Serial.println("� Device will sleep until next wakeup interval");
      
      // Put renderer to sleep before ESP32 sleeps
      if (putRendererToSleep()) {
        Serial.println("✓ Renderer sleep command sent successfully");
      } else {
        Serial.println("⚠ Failed to send renderer sleep command, proceeding with ESP32 sleep");
      }
      
      delay(1000); // Give renderer time to process sleep command
      
      // Put ESP32 into deep sleep
      Serial.println("💤 ESP32 entering deep sleep - both devices will be off");
      Serial.flush();
      delay(100);
      
      WiFi.disconnect(true);
      WiFi.mode(WIFI_OFF);
      
      // Configure wake-up source (using default 30 minute interval)
      uint64_t sleepTimeUS = 30ULL * 60ULL * 1000000ULL; // 30 minutes in microseconds
      esp_sleep_enable_timer_wakeup(sleepTimeUS);
      
      esp_deep_sleep_start();
    }
  }

  // Auto-fetch first image on boot if URLs are configured
  autoFetchOnBoot();
}

// Auto-fetch functionality that runs once on boot after WiFi/I2C initialization
static void autoFetchOnBoot() {
  Serial.println("=== AUTO-FETCH ON BOOT ===");
  unsigned long auto_fetch_start = millis();
  
  if (urlCount == 0) {
    Serial.println("No URLs configured - skipping auto-fetch");
    Serial.println("Add URLs via web interface or use default image");
    return;
  }
  
  if (!WiFi.isConnected()) {
    Serial.println("WiFi not connected - skipping auto-fetch");
    return;
  }
  
  Serial.printf("🚀 Auto-fetching image on boot: %s\n", getCurrentUrlAndAdvance().c_str());
  Serial.println("This will download and display the next image automatically...");
  
  // Test I2C connection before attempting transfer
  unsigned long i2c_test_start = millis();
  if (!testI2CConnection()) {
    Serial.println("❌ I2C connection test failed - cannot transfer image to renderer");
    Serial.println("Skipping auto-fetch due to I2C issues");
    return;
  }
  unsigned long i2c_test_time = millis() - i2c_test_start;
  Serial.printf("⏱️ I2C connection test: %lu ms\n", i2c_test_time);
  
  // Attempt to download and display the current image
  String currentUrl = getCurrentUrlAndAdvance();
  unsigned long download_start = millis();
  bool success = downloadAndConvertBmpImage(currentUrl.c_str());
  unsigned long download_time = millis() - download_start;
  Serial.printf("⏱️ Total download and transfer time: %lu ms (%.2f seconds)\n", download_time, download_time / 1000.0);
  
  if (success) {
    Serial.println("✅ Auto-fetch completed successfully!");
    Serial.println("Image should now be displaying on the e-paper screen");
    Serial.println("Battery info was sent to display before rendering to ensure current readings");
    
    // In battery mode, set flag to prevent main loop from doing another transfer
    uint8_t charging_status = getChargingStatus(); 
    if (charging_status != 1 && charging_status != 2) {
      Serial.println("🔋 BATTERY MODE: Auto-fetch completed - renderer will power off after display");
      Serial.println("💤 ESP32 will also enter deep sleep to save battery");
      auto_fetch_completed_in_battery_mode = true; // Set flag to trigger shutdown in loop
    }
  } else {
    Serial.println("❌ Auto-fetch failed - check URL and network connection");
  }
  
  unsigned long total_time = millis() - auto_fetch_start;
  Serial.printf("⏱️ TOTAL AUTO-FETCH TIME: %lu ms (%.2f seconds)\n", total_time, total_time / 1000.0);
  Serial.println("=== AUTO-FETCH COMPLETE ===");
}

// Download and convert BMP to e-paper format with streaming (192,000 bytes)
static bool downloadAndConvertBmpImage(const char* url) {
  Serial.printf("🚀 ESP32 PERFORMANCE: Starting BMP download and streaming conversion from: %s\n", url);
  
  // ESP32 HIGH-PRECISION TIMING for breakthrough performance measurement
  #ifdef ESP32_PERFORMANCE_OPTIMIZED
  int64_t total_start_time = esp_timer_get_time(); // Microsecond precision
  #else
  unsigned long total_start_time = millis();
  #endif
  
  HTTPClient http;
  WiFiClient* client = nullptr;
  
