c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
  // Check if URL is HTTPS and setup secure client
  bool isHttps = (strncmp(url, "https://", 8) == 0);
  if (isHttps) {
    Serial.println("🔒 HTTPS URL detected, setting up secure client...");
    WiFiClientSecure* secureClient = new WiFiClientSecure();
    secureClient->setInsecure(); // Skip certificate verification for now
    client = secureClient;
    http.begin(*secureClient, url);
  } else {
    Serial.println("🌐 HTTP URL detected, using standard client...");
    WiFiClient* standardClient = new WiFiClient();
    client = standardClient;
    http.begin(*standardClient, url);
  }
  
  http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
  
  // Optimized headers for faster downloads
  http.addHeader("User-Agent", "ESP32PhotoFrame/2.0 (Fast)");
  http.addHeader("Accept", "image/bmp,image/*,*/*");
  http.addHeader("Accept-Encoding", "identity"); // Disable compression for speed
  http.addHeader("Connection", "close");
  http.addHeader("Cache-Control", "no-cache"); // Ensure fresh content
  
  // OPTIMIZED timeouts for faster downloads
  http.setTimeout(12000); // 12 seconds for larger BMP files
#ifndef ESP8266
  http.setConnectTimeout(3000); // 3s connection timeout for faster initial connection
#endif
  http.setReuse(false); // Don't reuse connections for faster cleanup
  
  Serial.println("Making HTTP request with enhanced headers...");
  unsigned long http_start = millis();
  int httpCode = http.GET();
  unsigned long http_connect_time = millis() - http_start;
  Serial.printf("⏱️ HTTP connection and request: %lu ms\n", http_connect_time);
  
  if (httpCode > 0) {
    Serial.printf("✓ HTTP response code: %d\n", httpCode);
    
    // Debug response headers for troubleshooting
    String contentType = http.header("Content-Type");
    String contentLength = http.header("Content-Length");
    String location = http.header("Location");
    
    if (contentType.length() > 0) {
      Serial.printf("Content-Type: %s\n", contentType.c_str());
    }
    if (contentLength.length() > 0) {
      Serial.printf("Content-Length header: %s\n", contentLength.c_str());
    }
    if (location.length() > 0) {
      Serial.printf("Location (redirect): %s\n", location.c_str());
    }
    
    if (httpCode == HTTP_CODE_OK) {
      int contentLengthValue = http.getSize();
      Serial.printf("BMP file size: %d bytes\n", contentLengthValue);
      
      // Check available heap before proceeding
      Serial.printf("Free heap before conversion: %d bytes\n", ESP.getFreeHeap());
      
      // ESP32 MEMORY OPTIMIZATION: Monitor heap usage for massive buffer allocation
      uint32_t heap_before_buffers = ESP.getFreeHeap();
      Serial.printf("🧠 Free heap before MASSIVE buffer allocation: %d bytes (%.1f KB)\n", 
                   heap_before_buffers, heap_before_buffers / 1024.0);
      
      WiFiClient* stream = http.getStreamPtr();
      
      // Read BMP headers first
      const size_t header_size = sizeof(BMPFILEHEADER) + sizeof(BMPINFOHEADER);
      uint8_t* header_buffer = (uint8_t*)malloc(header_size);
      
      if (!header_buffer) {
        Serial.printf("✗ Failed to allocate header buffer (%d bytes)\n", header_size);
        cleanupHttpClient(http, client);
        return false;
      }
      
      // Read headers with aggressive buffering and timeout
      size_t header_read = 0;
      unsigned long start_time = millis();
      const unsigned long timeout = 2000; // 2 second timeout (was 3s) for maximum power efficiency
      
      Serial.printf("Reading BMP headers (%d bytes)...\n", header_size);
      unsigned long header_read_start = millis();
      
      while (header_read < header_size && (millis() - start_time) < timeout) {
        if (stream->available() > 0) {
          size_t available = stream->available();
          size_t to_read = min(available, header_size - header_read);
          size_t read_size = stream->readBytes(&header_buffer[header_read], to_read);
          
          if (read_size > 0) {
            header_read += read_size;
            Serial.printf("Read %d bytes, total: %d/%d\n", read_size, header_read, header_size);
          }
        }
      }
      
      unsigned long header_read_time = millis() - header_read_start;
      Serial.printf("⏱️ BMP header reading: %lu ms\n", header_read_time);
      
      if (header_read < header_size) {
        Serial.printf("✗ Failed to read BMP headers (got %d of %d bytes after %lu ms)\n", 
                     header_read, header_size, millis() - start_time);
        Serial.printf("Stream available: %d bytes\n", stream->available());
        free(header_buffer);
        cleanupHttpClient(http, client);
        return false;
      }
      
      Serial.printf("✓ Successfully read BMP headers (%d bytes)\n", header_read);
      
      // Parse BMP headers
      BMPFILEHEADER fileHeader;
      BMPINFOHEADER infoHeader;
      
      if (!parseBmpHeader(header_buffer, header_size, &fileHeader, &infoHeader)) {
        Serial.println("✗ Invalid BMP file format");
        free(header_buffer);
        cleanupHttpClient(http, client);
        return false;
      }
      
      free(header_buffer);
      
      Serial.printf("BMP dimensions: %dx%d pixels\n", infoHeader.biWidth, infoHeader.biHeight);
      Serial.printf("Bit depth: %d bits per pixel\n", infoHeader.biBitCount);
      Serial.printf("Data offset: %d bytes\n", fileHeader.bOffset);
      Serial.printf("Compression: %d\n", infoHeader.biCompression);
      Serial.printf("Image size: %d bytes\n", infoHeader.bimpImageSize);
      Serial.printf("Colors used: %d\n", infoHeader.biClrUsed);
      Serial.printf("Important colors: %d\n", infoHeader.biClrImportant);
      
      // Validate format - support both 8-bit indexed and 24-bit RGB
      if (infoHeader.biBitCount != 8 && infoHeader.biBitCount != 24) {
        Serial.printf("✗ Unsupported bit depth: %d (need 8-bit indexed or 24-bit RGB)\n", infoHeader.biBitCount);
        cleanupHttpClient(http, client);
        return false;
      }
      
