c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
      if (infoHeader.biWidth != 800 || infoHeader.biHeight != 480) {
        Serial.printf("✗ BMP dimensions (%dx%d) don't match display (800x480)\n", 
                     infoHeader.biWidth, infoHeader.biHeight);
        Serial.println("   → Use the ImageConverter tool to create properly sized BMPs");
        cleanupHttpClient(http, client);
        return false;
      }
      
      // Skip to pixel data
      size_t bytes_read_so_far = header_size;
      uint8_t* palette_buffer = nullptr;
      uint8_t* color_lookup = nullptr; // Declare color lookup table pointer
      
      // Read color palette for 8-bit indexed BMPs
      if (infoHeader.biBitCount == 8) {
        // 8-bit BMPs have a 256-color palette (4 bytes per color: B,G,R,reserved)
        size_t palette_size = 256 * 4;
        palette_buffer = (uint8_t*)malloc(palette_size);
        
        if (!palette_buffer) {
          Serial.printf("✗ Failed to allocate palette buffer (%d bytes)\n", palette_size);
          cleanupHttpClient(http, client);
          return false;
        }
        
        // Read palette with aggressive buffering
        size_t palette_read = 0;
        start_time = millis();
        
        Serial.printf("Reading BMP palette (%d bytes)...\n", palette_size);
        unsigned long palette_start = millis();
        
        while (palette_read < palette_size && (millis() - start_time) < timeout) {
          if (stream->available() > 0) {
            size_t available = stream->available();
            size_t to_read = min(available, palette_size - palette_read);
            size_t read_size = stream->readBytes(&palette_buffer[palette_read], to_read);
            
            if (read_size > 0) {
              palette_read += read_size;
              if (palette_read % 256 == 0) { // Progress every 256 bytes
                Serial.printf("Palette read: %d/%d bytes\n", palette_read, palette_size);
              }
            }
          }
        }
        
        unsigned long palette_time = millis() - palette_start;
        Serial.printf("⏱️ Palette reading: %lu ms\n", palette_time);
        
        if (palette_read < palette_size) {
          Serial.printf("✗ Failed to read BMP palette (got %d of %d bytes after %lu ms)\n", 
                       palette_read, palette_size, millis() - start_time);
          free(palette_buffer);
          cleanupHttpClient(http, client);
          return false;
        }
        
        Serial.printf("✓ Successfully read BMP palette (%d bytes)\n", palette_read);
        
        // SPEED OPTIMIZATION: Pre-compute color lookup table for all 256 palette entries
        color_lookup = (uint8_t*)malloc(256);
        if (!color_lookup) {
          Serial.println("✗ Failed to allocate color lookup table");
          free(palette_buffer);
          cleanupHttpClient(http, client);
          return false;
        }
        
        Serial.println("🚀 Pre-computing color lookup table for maximum speed...");
        for (int i = 0; i < 256; i++) {
          uint32_t offset = i * 4;
          uint8_t b = palette_buffer[offset];
          uint8_t g = palette_buffer[offset + 1]; 
          uint8_t r = palette_buffer[offset + 2];
          color_lookup[i] = rgbToEpaperColor(r, g, b);
        }
        Serial.println("✓ Color lookup table ready - no more per-pixel conversion needed!");
        
        // DEBUG: Print first 10 palette entries to verify colors
        Serial.println("=== PALETTE DEBUG (first 10 colors) ===");
        for (int i = 0; i < 10 && i < 256; i++) {
          uint32_t offset = i * 4;
          uint8_t b = palette_buffer[offset];
          uint8_t g = palette_buffer[offset + 1]; 
          uint8_t r = palette_buffer[offset + 2];
          uint8_t epaper_color = color_lookup[i];
          Serial.printf("Palette[%d]: RGB(%d,%d,%d) -> e-paper color %d\n", i, r, g, b, epaper_color);
        }
        Serial.println("========================================");
        
        bytes_read_so_far += palette_size;
      }
      
      // Skip any remaining bytes to reach pixel data with proper buffering
      Serial.printf("Skipping to pixel data offset %d (currently at %d)...\n", 
                   fileHeader.bOffset, bytes_read_so_far);
      
      while (bytes_read_so_far < fileHeader.bOffset) {
        if (stream->available() > 0) {
          size_t to_skip = min((size_t)stream->available(), 
                              (size_t)(fileHeader.bOffset - bytes_read_so_far));
          uint8_t* skip_buffer = (uint8_t*)malloc(min(to_skip, (size_t)8192)); // 8KB chunks for fast skipping (was 512)
          
          if (skip_buffer) {
            size_t skipped = stream->readBytes(skip_buffer, min(to_skip, (size_t)8192));
            bytes_read_so_far += skipped;
            free(skip_buffer);
            
            if (bytes_read_so_far % 1000 == 0) {
              Serial.printf("Skipped to offset: %d/%d\n", bytes_read_so_far, fileHeader.bOffset);
            }
          } else {
            // Fallback: skip one byte at a time
            uint8_t skip_byte;
            if (stream->readBytes(&skip_byte, 1) == 1) {
              bytes_read_so_far++;
            }
          }
        }
      }
      
      Serial.printf("Skipped to pixel data at offset %d\n", fileHeader.bOffset);
      
      // Now stream and convert pixel data with direct addressed writes
      // Validate BMP dimensions match display expectations
      if (infoHeader.biWidth != 800 || infoHeader.biHeight != 480) {
        Serial.printf("WARNING: BMP size %dx%d doesn't match display 800x480!\n", 
                     infoHeader.biWidth, infoHeader.biHeight);
        Serial.printf("This may cause addressing errors and display artifacts.\n");
      }
      
      const uint32_t epaper_size = 192000; // 800x480 pixels, 4 bits per pixel
      Serial.printf("✓ Display buffer size: %d bytes for %dx%d display\n", 
                   epaper_size, infoHeader.biWidth, infoHeader.biHeight);
      const uint32_t work_buffer_size = 32768; // SMART: 32KB buffer for optimal I2C performance with available heap
      uint8_t* work_buffer = (uint8_t*)malloc(work_buffer_size);
      
