c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
            }
          }
          
          // Optimized progress reporting for row processing (MINIMAL for speed)
          if (bmp_row == 0 || bmp_row == (int32_t)infoHeader.biHeight - 1) {
            float percent = ((float)(bmp_row + 1) / infoHeader.biHeight) * 100.0;
            Serial.printf("BMP processing: row %d/%d (%.1f%%)\n", 
                         bmp_row + 1, infoHeader.biHeight, percent);
          }
        }
        
        // ESP32 BREAKTHROUGH: Final streaming performance calculation
        #ifdef ESP32_PERFORMANCE_OPTIMIZED
        int64_t streaming_time_us = esp_timer_get_time() - streaming_start;
        float streaming_time_ms = streaming_time_us / 1000.0;
        float streaming_time_s = streaming_time_us / 1000000.0;
        
        Serial.printf("🚀 ESP32 BMP pixel streaming: %.1f ms (%.3f seconds) - PRECISION TIMING\n", 
                     streaming_time_ms, streaming_time_s);
        
        // ESP32 breakthrough performance detection for streaming
        if (streaming_time_s < 3.0) {
          Serial.printf("🎉 ESP32 STREAMING BREAKTHROUGH: %.3fs achieves sub-3s target!\n", streaming_time_s);
        } else if (streaming_time_s < 5.0) {
          Serial.printf("📈 ESP32 STREAMING PROGRESS: %.3fs approaching 3s target\n", streaming_time_s);
        } else {
          Serial.printf("⚡ ESP32 STREAMING BASELINE: %.3fs (target: <3s)\n", streaming_time_s);
        }
        #else
        unsigned long streaming_time = millis() - streaming_start;
        Serial.printf("⏱️ BMP pixel data streaming: %lu ms (%.2f seconds)\n", streaming_time, streaming_time / 1000.0);
        #endif
        
        Serial.printf("✅ ESP32 BMP streaming completed: %d bytes streamed\n", bytes_streamed);
        
        free(bmp_row_buffer);
        
        // Send any remaining data in work buffer using BURST MODE
        if (work_buffer_pos > 0) {
          // Send remaining buffer in BURST MODE for maximum speed
          if (!sendImageChunkBurst(bytes_streamed, work_buffer, work_buffer_pos)) {
            Serial.printf("✗ Failed to send final BMP chunk at offset %d\n", bytes_streamed);
            free(work_buffer);
            if (palette_buffer) {
              free(palette_buffer);
            }
            if (color_lookup) {
              free(color_lookup);
            }
            cleanupHttpClient(http, client);
            return false;
          }
          bytes_streamed += work_buffer_pos;
        }
        
        Serial.printf("✓ BMP streaming completed: %d bytes streamed\n", bytes_streamed);
        
        free(work_buffer);
        if (palette_buffer) {
          free(palette_buffer);
        }
        if (color_lookup) {
          free(color_lookup);
        }
        
        Serial.printf("✓ BMP streaming conversion completed: %d bytes processed\n", bytes_streamed);
        
        // Get battery info BEFORE sending render command (renderer will sleep after rendering)
        Serial.println("Getting battery status before rendering...");
        unsigned long battery_pre_start = millis();
        float voltage = getBatteryVoltage();
        if (voltage > 0.0f) {
          current_battery_voltage = voltage; // Update local cache
          Serial.printf("✓ Pre-render battery voltage: %.2fV\n", voltage);
        } else {
          Serial.printf("⚠ Could not get battery voltage, using cached: %.2fV\n", current_battery_voltage);
        }
        unsigned long battery_pre_time = millis() - battery_pre_start;
        Serial.printf("⏱️ Pre-render battery check: %lu ms\n", battery_pre_time);
        
        // Send battery info to display BEFORE rendering
        sendBatteryInfoToDisplay(current_battery_voltage, display_cycle_count);
        Serial.printf("🔋 Battery info sent before rendering: %.2fV, %u cycles\n", 
                     current_battery_voltage, display_cycle_count);
        
        // Send BMP reorder and render command (renderer will reorder from BMP to display format)
        unsigned long render_start = millis();
        if (!sendBmpRenderCommand()) {
          return false;
        }
        unsigned long render_command_time = millis() - render_start;
        Serial.printf("⏱️ Render command transmission: %lu ms\n", render_command_time);
        Serial.println("✓ Render command sent - Pi Pico will now render and may sleep in battery mode");
        
        // ESP32 BREAKTHROUGH PERFORMANCE: Final timing calculation with microsecond precision
        #ifdef ESP32_PERFORMANCE_OPTIMIZED
        int64_t total_processing_time_us = esp_timer_get_time() - total_start_time;
        float total_processing_time_ms = total_processing_time_us / 1000.0;
        float total_processing_time_s = total_processing_time_us / 1000000.0;
        
        Serial.printf("🚀 ESP32 TOTAL BMP PERFORMANCE: %.1f ms (%.3f seconds) - PRECISION TIMING\n", 
                     total_processing_time_ms, total_processing_time_s);
        
        // Performance breakthrough detection
        if (total_processing_time_s < 5.0) {
          Serial.printf("🎉 ESP32 BREAKTHROUGH: %.3fs achieves 5-second target!\n", total_processing_time_s);
        } else if (total_processing_time_s < 8.0) {
          Serial.printf("📈 ESP32 PROGRESS: %.3fs approaching 5-second target\n", total_processing_time_s);
        } else {
          Serial.printf("⚡ ESP32 BASELINE: %.3fs (target: <5s)\n", total_processing_time_s);
        }
        
        // Advanced performance statistics with ESP32 precision
        if (total_bytes_transferred > 0) {
          float avg_speed_kbps = (float)total_bytes_transferred / (total_processing_time_s * 1000.0);
          Serial.printf("📊 ESP32 I2C Performance: %zu bytes in %.1f KB/s avg throughput\n", 
                       total_bytes_transferred, avg_speed_kbps);
        }
        #else
        unsigned long total_processing_time = millis() - total_start_time;
        Serial.printf("⏱️ TOTAL BMP PROCESSING TIME: %lu ms (%.2f seconds)\n", 
                     total_processing_time, total_processing_time / 1000.0);
        #endif
        
        Serial.println("✅ ESP32 BMP streaming conversion and render command complete");
        
        // Clean up HTTP client and WiFiClient
        http.end();
        if (client) {
          delete client;
          client = nullptr;
        }

        
