c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
        return true;
    } else {
      Serial.printf("✗ HTTP error: %d\n", httpCode);
      
      // Provide specific error explanations
      if (httpCode == 404) {
        Serial.println("   → File not found. URL may be expired or incorrect.");
      } else if (httpCode == 403) {
        Serial.println("   → Access forbidden. Check URL permissions.");
      } else if (httpCode == 301 || httpCode == 302) {
        Serial.println("   → Redirect detected. URL may have moved.");
        String location = http.header("Location");
        if (location.length() > 0) {
          Serial.printf("   → Redirect location: %s\n", location.c_str());
        }
      } else if (httpCode == 400) {
        Serial.println("   → Bad request. URL format may be malformed.");
      } else if (httpCode == 500) {
        Serial.println("   → Server error. Try again later.");
      }
      
      // Check if we got any response body for debugging
      if (http.getSize() > 0) {
        String response = http.getString();
        if (response.length() > 0 && response.length() < 500) {
          Serial.printf("   → Server response: %s\n", response.c_str());
        }
      }
    }
  } else {
    Serial.printf("✗ HTTP connection failed: %s\n", http.errorToString(httpCode).c_str());
    
    // Enhanced error reporting for HTTPS/SSL issues
    if (isHttps) {
      Serial.println("🔒 HTTPS connection troubleshooting:");
      if (httpCode == -1) {
        Serial.println("   → SSL handshake failed or timeout");
        Serial.println("   → This is common with GitHub raw URLs");
        Serial.println("   → Try using HTTP instead: http://example.com/image.bmp");
      } else if (httpCode == -11) {
        Serial.println("   → SSL connection timeout");
        Serial.println("   → Server may not support SSL or certificate expired");
      } else if (httpCode == -5) {
        Serial.println("   → Connection refused");
        Serial.println("   → Server may be blocking ESP32 user agent");
      }
    }
    
    Serial.println("   → Check WiFi connection and URL validity.");
    Serial.printf("   → HTTP error code: %d\n", httpCode);
  }

  http.end();
  
  // Clean up WiFiClient
  if (client) {
    delete client;
    client = nullptr;
  }
  
  
  return false;
}

void loop() {
  // Handle web server requests (only when connected to WiFi)
  if (WiFi.status() == WL_CONNECTED) {
    server.handleClient();
  }
  
  // Process WiFiManager - this handles the portal and connection attempts
  wm.process();
  
  // Check if WiFi just got connected and we need to start the web server
  static bool wasConnected = false;
  bool isConnected = (WiFi.status() == WL_CONNECTED);
  
  if (!wasConnected && isConnected) {
    Serial.println("✅ WiFi connected successfully!");
    Serial.printf("✅ Connected to: %s\n", WiFi.SSID().c_str());
    Serial.printf("🌐 IP address: %s\n", WiFi.localIP().toString().c_str());
    
    // Initialize web server after successful WiFi configuration
    setupWebServer();
  }
  wasConnected = isConnected;
  
  static unsigned long lastImageSend = 0;
  static bool i2cWorking = false;
  static unsigned long lastI2CTest = 0;
  static bool powerModeChecked = false;
  static bool isChargingMode = false;
  unsigned long currentTime = millis();
  
  // Check charging status once at startup to determine operating mode
  if (!powerModeChecked) {
    uint8_t charging_status = getChargingStatus();
    current_charging_status = charging_status;
    
    if (charging_status == 1 || charging_status == 2) {
      // Charging or charge complete - web server only mode
      isChargingMode = true;
      Serial.println("🔌 CHARGING MODE: Power connected - running web server only (no automatic image updates)");
      Serial.println("📱 Use the web interface to manually control image display");
      
      // Show IP if connected to WiFi
      if (WiFi.status() == WL_CONNECTED) {
        Serial.printf("🌐 Access control panel at: http://%s\n", WiFi.localIP().toString().c_str());
      } else {
        Serial.println("🌐 WiFi not connected - control panel not available");
      }
    } else {
      // Battery mode - normal power-efficient operation
      isChargingMode = false;
      Serial.println("🔋 BATTERY MODE: No external power - will display image and enter deep sleep");
    }
    powerModeChecked = true;
  }
  
  // If in charging mode, only handle web server - no automatic image processing
  if (isChargingMode) {
    // Just run the web server and periodic status updates
    // Update status from Pi Pico periodically for web UI
    static unsigned long lastStatusUpdate = 0;
    if (currentTime - lastStatusUpdate > 30000) { // Every 30 seconds when charging
      float new_voltage = getBatteryVoltage();
      uint32_t new_interval = getWakeupInterval();
      uint8_t new_charging_status = getChargingStatus();
      
      if (new_voltage >= 0.0f) {
        current_battery_voltage = new_voltage;
        // Send battery info to display for overlay  
        sendBatteryInfoToDisplay(current_battery_voltage, display_cycle_count);
      }
      if (new_interval > 0) {
        current_wakeup_interval = new_interval;
      }
      current_charging_status = new_charging_status;
      
      lastStatusUpdate = currentTime;
    }
    
    // Simple heartbeat for charging mode
    static unsigned long lastHeartbeat = 0;
    if (currentTime - lastHeartbeat > 300000) { // Every 5 minutes when charging
      Serial.printf("🔌 CHARGING MODE: Web server active | Battery: %.2fV | Free heap: %u bytes\n", 
                    current_battery_voltage, ESP.getFreeHeap());
      lastHeartbeat = currentTime;
    }
    
    return; // Exit loop - no image processing in charging mode
  }
  
  // BATTERY MODE ONLY - Continue with original power-efficient behavior
  
  // Check if auto-fetch completed successfully in battery mode - if so, shutdown immediately
  if (auto_fetch_completed_in_battery_mode) {
    Serial.println("🔋 BATTERY MODE: Auto-fetch completed successfully during setup");
    Serial.println("💤 Waiting for renderer to finish and power off, then shutting down ESP32");
    
    // Give renderer time to complete rendering and power off (it has 3 second delay)
    delay(5000); // 5 seconds should be enough for renderer to complete and sleep
    
    // Now shutdown ESP32
    Serial.println("🔋 BATTERY MODE: Shutting down ESP32 after auto-fetch success");
    shutdownESP32(); // This function never returns
  }
  // Test I2C connection every 30 seconds if it's not working
  if (!i2cWorking && (currentTime - lastI2CTest > 30000)) {
    Serial.println("=== RETESTING I2C CONNECTION ===");
    i2cWorking = testI2CConnection();
    lastI2CTest = currentTime;
    
    if (!i2cWorking) {
      Serial.println("⚠ I2C still not working - skipping image transfer");
      Serial.println("CHECK:");
      Serial.println("  1. Is Pi Pico powered and running?");
      Serial.println("  2. Is renderer.cpp uploaded to Pi Pico?");
      Serial.println("  3. Are I2C wires connected: ESP32-21→Pico-4, ESP32-22→Pico-5?");
      Serial.println("  4. Is Pi Pico I2C address set to 0x42?");
      return; // Skip this loop iteration
    } else {
      Serial.println("✓ I2C connection restored!");
    }
  }
  
  // BATTERY MODE ONLY - Only proceed with image transfer if I2C is working
  // SINGLE-SHOT mode: Send image once, wait for completion, then shutdown for maximum power savings
  if (i2cWorking && lastImageSend == 0) { // Only run once for battery conservation
    Serial.println("🔋 BATTERY MODE: Single-shot power-efficient image transfer");
    
    // Check slave status first
    uint8_t status = getSlaveStatus();
    Serial.printf("Pi Pico status: 0x%02X\n", status);
    
    if (status == STATUS_READY || status == STATUS_ERROR || status == STATUS_BATTERY_SET) {
      // Get next URL from the cycling list
      String imageUrl = getCurrentUrlAndAdvance();
      
