c-mauderer/PhotoPainter-ESP32/src/fetcher.cpp
      if (imageUrl.length() == 0) {
        Serial.println("✗ No URLs configured - cannot download image");
        Serial.println("💤 Going to deep sleep - configure URLs via web interface when charging");
        
        // Put renderer to sleep and then ESP32
        if (putRendererToSleep()) {
          Serial.println("✓ Renderer sleep command sent successfully");
        }
        
        delay(1000);
        WiFi.disconnect(true);
        WiFi.mode(WIFI_OFF);
        esp_deep_sleep_start();
        return; // Should not reach here
      }
      
      Serial.printf("🔋 BATTERY MODE: Converting and streaming BMP from: %s\n", imageUrl.c_str());
      bool transfer_success = false;
      
      if (downloadAndConvertBmpImage(imageUrl.c_str())) {
        Serial.println("✓ BMP conversion and streaming completed successfully");
        
        // Wait for renderer to complete the display update
        if (waitForRenderCompletion(30000)) { // 30 second timeout
          Serial.println("✓ COMPLETE SUCCESS: Image transfer and rendering finished!");
          transfer_success = true;
        } else {
          Serial.println("⚠ Render completion timeout - may still be working");
        }
      } else {
#ifdef ESP8266
        Serial.println("⚠ BMP conversion failed, send nothing");
#else
        Serial.println("⚠ BMP conversion failed, trying static image as fallback");
        
        // Fallback to static image
        if (sendCompleteImage()) {
          Serial.println("✓ Fallback image transfer completed successfully");
          
          // Wait for renderer to complete the display update
          if (waitForRenderCompletion(30000)) { // 30 second timeout
            Serial.println("✓ COMPLETE SUCCESS: Fallback image transfer and rendering finished!");
            transfer_success = true;
          } else {
            Serial.println("⚠ Fallback render completion timeout - may still be working");
          }
        } else {
          Serial.println("✗ Even fallback image transfer failed");
        }
#endif
      }
      
      // BATTERY MODE: Always go to deep sleep after image transfer (ignore web server activity)
      if (transfer_success) {
        Serial.println("🔋 BATTERY MODE: Shutting down ESP32 after successful operation for maximum power savings");
        shutdownESP32(); // This function never returns
      } else {
        Serial.println("⚠ BATTERY MODE: Transfer had issues - attempting deep sleep anyway to save battery");
        
        // Put renderer to sleep and then ESP32
        if (putRendererToSleep()) {
          Serial.println("✓ Renderer sleep command sent successfully");
        }
        
        delay(1000);
        WiFi.disconnect(true);
        WiFi.mode(WIFI_OFF);
        esp_deep_sleep_start();
        return; // Should not reach here
      }
      
    } else {
      Serial.printf("🔋 BATTERY MODE: Slave not ready (status: 0x%02X) - will retry in next cycle\n", status);
    }
  }
  
  // Initial I2C test on first run (battery mode only)
  if (!i2cWorking && lastI2CTest == 0) {
    Serial.println("=== INITIAL I2C CONNECTION TEST (BATTERY MODE) ===");
    i2cWorking = testI2CConnection();
    lastI2CTest = currentTime;
  }
  
  // Check connection health periodically (reduced frequency for power efficiency)
  static unsigned long lastHealthCheck = 0;
  if (currentTime - lastHealthCheck > 20000) { // Every 20 seconds (was 10) for less overhead
    checkI2CConnectionHealth();
    lastHealthCheck = currentTime;
  }
  
  // Simple heartbeat (reduced frequency for power efficiency during standby)
  static unsigned long lastHeartbeat = 0;
  if (currentTime - lastHeartbeat > 120000) { // Every 120 seconds during standby
    Serial.printf("🔋 BATTERY MODE: I2C: %lu transactions, %lu errors\n", 
                  i2cTransactionCount, errorCount);
    if (lastImageSend == 0) {
      Serial.println("STATUS: Waiting for I2C to become ready for single-shot transfer");
    } else {
      Serial.println("STATUS: Single-shot transfer attempted");
    }
    lastHeartbeat = currentTime;
  }

}
